 [
  {
  "_id": "1453863252",
  "_rev": "6-8dc515401c8c924db18467b122abb09e",
  "articles": [
               {
               "origin": {
               "url": "http://feeds.nytimes.com/nyt/rss/Technology",
               "name": "nytimes"
               },
               "timestamp": 1453865926,
               "top_image": {
               "original": "http://static01.nyt.com/images/2016/01/27/technology/27apple-web/27apple-web-facebookJumbo.jpg"
               },
               "link": "http://www.nytimes.com/2016/01/27/technology/apple-earnings-iphone-sales.html?partner=rss&emc=rss",
               "title": "Apple Reports Slowing Growth for iPhone Sales"
               },
               {
               "origin": {
               "url": "http://rssfeeds.usatoday.com/usatoday-TechTopStories",
               "name": "usatoday"
               },
               "timestamp": 1453869131,
               "top_image": {
               "original": "http://www.gannett-cdn.com/-mm-/d7dbc1841d23a49a2339ee4cb6d9d446041bfc46/c=0-240-3210-2054&r=x1683&c=3200x1680/local/-/media/2015/12/23/USATODAY/USATODAY/635864938942153406-AP-SINGAPORE-SOLAR-APPLE-77580482.JPG"
               },
               "link": "http://rssfeeds.usatoday.com/~/134747421/0/usatoday-techtopstories~Apples-Cook-sees-China-Brazil-and-Russia-slowdown/",
               "title": "Apple's Cook sees China, Brazil and Russia slowdown"
               },
               {
               "origin": {
               "url": "http://www.cnet.com/rss/news",
               "name": "cnet"
               },
               "timestamp": 1453866510,
               "top_image": {
               "original": "http://cnet3.cbsistatic.com/hub/i/r/2015/09/26/c4133d0f-3431-4570-88c6-4f279f941e02/thumbnail/670x503/58b45545ffb08d27ca4adfa144b67324/apple-iphone-6s-plus-silver-3033-025.jpg"
               },
               "link": "http://cnet.com.feedsportal.com/c/34938/f/645093/s/4d268733/sc/15/l/0L0Scnet0N0Cnews0Capples0Eiphone0Egrowth0Ehits0Ea0Ewall0C0Tftag0FCAD590Aa51e/story01.htm",
               "title": "Apple's iPhone growth hits a wall"
               },
               {
               "origin": {
               "url": "http://recode.net/feed",
               "name": "recode"
               },
               "timestamp": 1453863252,
               "top_image": {
               "original": "https://recodetech.files.wordpress.com/2015/09/iphone-plan-box-201509.png"
               },
               "link": "http://recode.net/2016/01/26/apple-posts-slowest-iphone-growth-since-smartphones-introduction/",
               "title": "Apple Posts Slowest iPhone Sales Growth Since 2007"
               },
               {
               "origin": {
               "url": "http://rssfeeds.usatoday.com/usatoday-TechTopStories",
               "name": "usatoday"
               },
               "timestamp": 1453865409,
               "top_image": {
               "original": "http://www.gannett-cdn.com/-mm-/7b7f465fe940e32ec69d96052d4242c95eb9a88c/c=0-50-1024-629&r=x633&c=1200x630/local/-/media/2015/12/16/USATODAY/USATODAY/635858701014697993-GTY-459774380-69138598.JPG"
               },
               "link": "http://rssfeeds.usatoday.com/~/134753683/0/usatoday-techtopstories~Apple-iPhone-sales-and-Cook-warns-on-quarter/",
               "title": "Apple iPhone sales slow and Cook warns on quarter"
               },
               {
               "origin": {
               "url": "http://feeds.bbci.co.uk/news/technology/rss.xml",
               "name": "bbc"
               },
               "timestamp": 1453866683,
               "top_image": {
               "original": "http://ichef-1.bbci.co.uk/news/1024/cpsprodpb/4B18/production/_87942291_applelogo.jpg"
               },
               "link": "http://www.bbc.co.uk/news/business-35412892#sa-ns_mchannel=rss&ns_source=PublicRSS20-sa",
               "title": "Apple iPhone sales growth slowest ever"
               },
               {
               "origin": {
               "url": "http://www.ibtimes.com/rss/technology",
               "name": "ibtimes"
               },
               "timestamp": 1453864048,
               "top_image": {
               "original": "http://s1.ibtimes.com/sites/www.ibtimes.com/files/2016/01/26/image-489962750.jpg"
               },
               "link": "http://www.ibtimes.com/apple-inc-aapl-q1-2016-misses-iphone-sales-revenue-sets-184-billion-profit-record-2280876",
               "title": "Apple Inc. (AAPL) Q1 2016 Misses On iPhone Sales, Revenue, But Sets $18.4 Billion Profit Record"
               },
               {
               "origin": {
               "url": "http://rssfeeds.usatoday.com/usatoday-TechTopStories",
               "name": "usatoday"
               },
               "timestamp": 1453866096,
               "top_image": {
               "original": "http://www.gannett-cdn.com/-mm-/d7dbc1841d23a49a2339ee4cb6d9d446041bfc46/c=0-240-3210-2054&r=x1683&c=3200x1680/local/-/media/2015/12/23/USATODAY/USATODAY/635864938942153406-AP-SINGAPORE-SOLAR-APPLE-77580482.JPG"
               },
               "link": "http://rssfeeds.usatoday.com/~/134747421/0/usatoday-techtopstories~Live-blog-Apples-Cook-sees-China-slowdown/",
               "title": "Apple's Cook sees China slowdown"
               }
               ],
  "images": [
             "http://s1.ibtimes.com/sites/www.ibtimes.com/files/styles/embed/public/2016/01/26/tim-cook-apple-inc-earnings-q1-2016.jpg",
             "http://s1.ibtimes.com/sites/www.ibtimes.com/files/styles/embed/public/2016/01/26/image-489962750.jpg"
             ],
  "texts": [
            "Apples iPhone has officially entered a slow-growth period. Apple on Tuesday said that it sold 74.8 million iPhones in its fiscal first quarter, which ended Dec. 26, up less than 1 percent from the 74.5 million sold a year ago. That represented the slowest year-over-year rate of growth for the device since it was introduced in 2007. The iPhone, Apples flagship product, is closely watched by investors because the smartphone accounts for two-thirds of the companys annual revenue. In total, Apples revenue for the quarter was $75.9 billion, up 1.7 percent from a year ago, and lower than Wall Street forecasts of $76.6 billion. Net profit was $18.4 billion, up from $18 billion a year earlier. Apples rate of growth is not set to improve anytime soon. The company, based in Cupertino, Calif., also issued a lower-than-anticipated forecast for the current quarter, which ends in March. Apple projected revenue of $50 billion to $53 billion, down from $58 billion from a year earlier and lower than the $55.4 billion forecast by Wall Street, according to S&P Capital IQ. The results and forecast reflect how Apple, under its chief executive, Timothy D. Cook, is grappling with becoming a maturing tech company. While Apple once delivered high double-digit revenue gains on the back of soaring sales of the iPhone and other devices, growth rates have slowed as the iPhone has begun saturating the market and the company has not introduced a new blockbuster device. Investors are already treating Apple more like a value stock than a growth stock, associating the company with predictable business results and a reliable dividend rather than runaway revenue growth. In the period leading up to the earnings announcement, investors had lowered expectations for the quarter based on the belief that demand for Apples latest iPhones, the 6S and 6S Plus, had been weak. Several companies that supply iPhone parts to Apple recently blamed a lack of demand for their lower-than-expected financial results. There will be some speed bumps ahead until we get to the iPhone 7 mega-product cycle later this year, said Daniel Ives, an analyst at FBR Capital Markets. Luca Maestri, Apples chief financial officer, said in an interview that the results were affected by the strengthening United States dollar. In the December quarter alone, the foreign exchange impact was $5 billion to our revenue line, he said. If you take $100 of the business that we did outside of the U.S. in September 2014, when we launched the iPhone 6 and 6 Plus, the same level of business today translates to only $85. Other growth areas that Apple has relied upon are also starting to see a slowdown. Sales in the greater China region, which are among the companys biggest markets, rose 14 percent in the quarter from a year ago  yet annual revenue growth from the region has hovered at around 70 percent or more in the last four quarters. With the iPhones sales growth flattening, other products did not pick up the slack. Sales of the iPad tablet dropped 25 percent from a year earlier in terms of units, while Mac computers declined 4 percent. The company did see growth in services, where revenue rose 26 percent, while revenue from a category known as other products  which include the Apple Watch  increased 62 percent. As Apple matures, Mr. Maestri said, the company could become a business that delivers steady incremental financial advances through its huge installed base of one billion active devices currently used by consumers. He pointed in particular to the potential of the services business, which includes the iTunes Store, the App Store and Apple Music. The market has not fully understood that we have a portion of our business directly tied to our incredible installed base thats not driven by quarterly results, Mr. Maestri said. Those customers engage with our services and that business, which is a $20 billion business, is growing at more than 25 percent during the last 12 months.",
            "Apple shares are down 30% from last year's highs. That's just one of the challenges facing the company. (Photo: AP) Apple CEO Tim Cook presented his take on the company's quarterly results in a conference call with analysts. For the first time ever, iPhone growth has slowed, but in the call, he said he didn't believe the iPhone had peaked--or perhaps really needed some new features that would really appeal to customers. The upcoming quarter is going to be challenging, the worst quarter of the year, he said, to which he blamed the economies in Brazil and Russia, primarily. Apple stock closed up 55 cents a share at $99.99 before the results were announced, and went down $2.27 in after-hours trading to $97.72. Our live blog of the call: 2:00 PT: Cook opens the call by announcing the quarterly results, and says international dollar valuations have been challenging for the company. \"The movement has been dramatic.\" But Apple had the best numbers ever in China for the quarter, he said. But he started to see slowness in China in December. \"We remain very confident in long term potential,\" for the Chinese market. \"Apple remains incredibly strong,\" he added. \"We are very optimistic about our business.\" In last quarter, Apple introduced a revamped Apple TV, larger iPad and the new iPhone 6S. Set a quarterly record for Apple Watch sales, but he didn't reveal numbers. Cook said there are 1 billion Apple iPhone and iPad devices in use. 2:20 Apple's senior vice-president Luca Maestri recites numbers from around the world. Mac sales are down 4%, he said. iPad sales 16 million, compared to 21 million in year ago quarter. So Mac and iPad are both down. Maestri reads guidance--between $50 to $53 billion. A wider range than usual, he said, because of the uncertainty of international markets. March will be the most difficult quarter of the year, he added. 2:27 p.m. Question from Goldman Sachs analyst about guidance. Maestri says in constant currency, revenue would be down 5-10%. Macro environment is weakening, he added. \"Clearly the economy is significantly weaker than it was a year ago,\" he said, referring to Brazil, Russia and other companies. Apple has responded by raising the prices on products, but they effect demand as well. 2:30 Gene Munster from Piper Jaffray asks Cook about the iPhone upgrade program, and how it worked. He also wants to know what he thinks of virtual reality. \"We were blown away by the number of Android switchers we had in last quarter. We see that as a huge opportunity.\" Over time, the upgrade program will be meaningful, he added. For VR, \"I don't think it's a niche. It's really cool and has some interesting applications. 2:36 Bernstein analyst asks Cook about the expected iPhone shipment declines in the coming quarter. Is this because the iPhone has peaked and the market is saturated? Cook: \"We do think iPhone units will decline in the quarter. We aren't projecting beyond the quarter, but we see that Q2 is the toughest compare, because the year ago quarter also had catch-up in it from Q1. We were supply constrained from Q1. We're in an environment that's totally different from a macro economic view. The overall malaise in virtually every country in the world.\" On saturation, the \"metrics I see would strongly suggest otherwise,\" from the analyst's saturation question. \"Almost half of the iPhones we sold in China last quarter were to people buying their first iPhone.\" 2:44 Cross Research analyst Shannon Cross asks about research and development. \"We're continuing to invest without pause. We believe in investing through downturns. Our expansion plans in China have not changed. We're also continuing to invest in markets that are great for Apple in the long term, like India. Even in markets that look bleak, like Brazil and Russia, we believe this too shall pass. We're not retrenching. We don't believe in that.\" 2:47 Drexel analyst asks about next leg of growth in China and investing in India. For China, Cook says, \"the LTE penetration as of October was in the mid-20s. There's an enormous upgrade cycle there. The middle class in China was less than 50 million people in 2010, and by 2020 it's projected to be half a billion. We think this provides us a great opportunity to win over some of those customers. The demographics are great. We're on target to have 40 stores in China by summer. We remain very bullish on China and don't subscribe to the doom and gloom predictions.\" India is \"very exciting. It's growth is very good. Third largest smartphone market in the world, after China and the United States. Almost half of the people in India are under 25. The demographics are great for a consumer brand, and for people who want the very best products. India revenue was up 38% in the quarter. It's a rapidly expanding country.\" 2:51 p.m. An analyst asks about iPhone upgrades. How many have done it? Cook says 40% of the Apple base has upgraded to the new 6 or 6S phones. 2:56 CitiBank analyst asks about macro economic situation. Is it time to go beyond premium pricing? \"Our strategy is to make the best products,\" says Cook. \"For smartphone market we have several different price points for our customers. I don't see us deviating from that approach.\" Apple's quarterly results: revenue of $75.9 billion and net income of $18.4 billion, or $3.28 per diluted share. That is slightly on par with analysts expectations, who projected revenues of $76 billion, or $3.23 a share. In the year ago quarter, Apple reported revenues of $74.599 billion. But for the quarter, Apple said it sold 74.8 million iPhones, which is slightly lower--0.4%, than the year-ago quarter, and the first time Apple didn't seriously grow the iPhone brand with a new edition. Here's thoughts from Apple analyst Daniel Ives: \"Apple delivered revenue of $75.9 billion vs. the Street at $76.7 billion and guidance of $75.50-$77.50 billion. EPS of $3.28 vs. the Street at $3.23, gross margins were 40.1% vs. the Street at 39.9%. Overall given the white knuckles fears going into this print, we would characterize the overall headline performance as better than feared. -the main focus will be Apples iPhone unit number of 74.5 million vs. the Street at 75.5 million. Holiday sales were telegraphed to be good through the supply chain checks, but not great and these results support Street sentiment heading into the print. Greater China was up 14% year over year and 50% sequentially which speaks to strength on this number despite macro headwinds. Overall, there were draconian fears heading into this print and we would view this a small step in the right direction given bear sentiment on the name. Cook and Apple have some more wood to chop over the coming quarters to give investors further confidence in the potential mega cycle around iPhone 7. -The Street was bracing for a weak March guide and Cook ripped the band-aid off with a $50 billion to $53 billion estimate vs. the Street at $55.6 billion. The Street was fearing a sub $50 billion guide so we would characterize this as a B- guidance with fears of a C in the cards. -Overall, the near-term period it will be choppy into March/June but Cook & Co. need to give investors something to hang their hat on which is all around iPhone 7 later this year. Its a groundhog day from 5s to iphone 6-thats the bull thesis heading into iPhone 7. Investors will be laser focused on China growth into 2016, Apple Watch sales which looked to have a good holiday season and showed some life, and what/if any plans Apple has for its $200 billion+ of cash sitting in its treasure chest. \" Gene Munster, Piper Jaffray: \"Now that the March and June iPhone numbers have been reset, we believe investors will have more confidence to invest in AAPL in anticipation of catalysts in mid- and late-2016. The irony of the weak iPhone numbers in 2016 is it of course makes the comps easier next year. We expect Apple will increase its capital distribution program when it reports the March quarter in April. While we believe that this is largely expected by investors, we still feel that it has the chance to be a mild positive nonetheless. Beyond the March quarter, we expect the multiple on shares of AAPL to expand in anticipation of the full cycle iPhone 7 in September (will potentially have a slightly larger screen with the removal of the home button along with a new smaller 4\" iPhone). Additionally, we expect the favorable impact of the iPhone Upgrade Program, which will first help the Dec-16 quarter and ramp from there, will be a growing theme with investors. As a reminder, we believe the iPhone Upgrade Program and US carriers selling iPhones with an annual upgrade option should improve the pace of iPhone upgrades from 22 months to 15 months in the US. We believe that as this program gets rolled out internationally (Apple has announced it will be available outside the US, but has not given timing), it could add an incremental 3-5% to iPhone unit growth for several years starting in 2017. Lastly, AAPL's multiple has expanded ~30% in anticipation of a full iPhone for the last two full cycle launches (iPhone 5, iPhone 6) with an average multiple in September of ~15x vs the current out year multiple of 10x CY17E EPS. In March, Apple is expected to unveil a new addition to the iPhone lineup, with a smaller screen for those who think the current 4.7 inch and 5.5 inch iPhones are too large. The company is also expected to bring out the second edition of the Apple Watch. Of all the new Apple products in recent times, the Apple Watch didn't turn into a blockbuster, with analysts pegging sales at anywhere between 10 to 20 million units. Read or Share this story: http://usat.ly/1VoUPEx",
            "Enlarge Image Josh Miller/CNET We may be finally getting over the iPhone. Apple on Tuesday reported selling 74.8 million iPhones in the fiscal first quarter ended December 26, missing Wall Street expectations and posting the slowest growth since the company began selling the smartphones in 2007. In the same quarter last year, it sold 74.5 million units, and analysts had expected the company to sell 76.3 million units this year, according to a poll by Fortune. What's worse, Apple predicted total company revenue would slide next quarter and said Phone sales are in for their first slump ever in the March period. CEO Tim Cook blamed Apple's weaker results on the stronger value of the US dollar and global economic softness. \"We are seeing extreme conditions unlike anything we have ever experienced before,\" he said during a conference call with analysts. The numbers -- massive for any other company but worrisome for Cupertino, California-based Apple -- underscores the cooling attitude toward phones in general. More than two-thirds of Apple's revenue now comes from the iPhone, and the problem is Apple's next big thing, whether it's the Apple Watch or a bigger iPad, hasn't really gotten us excited. The popularity of the redesigned iPhone 6, released in September 2014, led Apple to report the highest profit ever of any public company in last year's first quarter. Apple on Tuesday once again reported the most profitable quarter in history. But the latest iPhone models, the 6S and 6S Plus, didn't add enough new features to prompt customers in places like the US to upgrade. In addition, the economy in China, one of Apple's most important markets, has been struggling and may have put a damper on the willingness of consumers there to snap up a new phone. First ever iPhone sales drop Apple typically doesn't provide estimates for iPhone sales in future quarters, but Cook on Tuesday confirmed that iPhone unit sales will fall in the current quarter for the first time ever. He wouldn't comment about expectations iPhone sales will drop for the full year and said he doesn't think the market is saturated. Almost half of the iPhones sold in China in the December quarter were to people buying their first smartphone, and Apple also sees opportunities in other emerging markets. \"This indicates to me there's still a tremendous number of people in the world who will buy smartphones and we ought to be able to win over our fair share of those,\" Cook said. Piper Jaffray analyst Gene Munster noted Apple's March revenue forecast implies it will sell 50 million to 52 million iPhones in the period. Before Tuesday's report, analysts projected Apple would sell about 55 million iPhones in the second quarter. Part of the expected iPhone weakness is due to China. Cook on Tuesday said Apple started seeing some signs of economic weakness in China earlier this month, particularly in Hong Kong, but added he remains confident in the longer term. In the December quarter, sales in Greater China, which includes mainland China, Taiwan and Hong Kong, rose 14 percent to $18.4 billion. The region has been one of Apple's most important markets in recent quarters and even surpassed the US to become Apple's biggest iPhone market in last year's March quarter. March wobbles Analysts had largely expected Apple to post a slight increase in this year's first-quarter iPhone sales but hit a speed bump in the current March quarter. More than 10 of the company's major suppliers have warned business has slowed down in recent weeks, and it's hard to imagine that Apple would be immune to those woes. \"There are downside concerns given continued negative data points from the supply chain as well as continued currency deterioration, particularly in China,\" UBS analyst Steven Milunovich said in a note before Apple's earnings release. For the March quarter, Apple projected revenue of $50 billion to $53 billion, down from $58 billion last year. Analysts polled by Thomson Reuters had expected sales of $55.48 billion. The decline would be Apple's first drop in a decade. In the December quarter, Apple reported revenue of $75.9 billion, compared with $74.6 billion in the year-earlier period. Wall Street had expected sales to total $76.5 billion. Net income increased to $18.4 billion, or $3.28 a share, from $18 billion, or $3.06 a share, last year. Analysts estimated per-share earnings of $3.23 a share. iPad and Mac declines Apple's iPad business continued to struggle during the quarter despite the introduction of the 12.9-inch iPad Pro. The company launched the device in November to attract business users and other buyers to its tablet line, which has been struggling for the past couple of years. Overall, iPad unit sales dropped 25 percent to 16.1 million. Analysts polled by Fortune expected it to sell 17.8 million units. This quarter's sales decline marks the eighth time in a row iPad sales have fall from the previous year. Macintosh computer sales also slid in the period, down 3.8 percent to 5.3 million. Analysts projected sales of 5.8 million. Apple didn't break out Apple Watch sales figures. The company lumps the device in with \"other products\" like iPods. Revenue for that segment grew 62 percent to $4.4 million. Analysts polled by Fortune believe Apple sold 5.5 million Apple Watches during the December quarter. Cook didn't give more information about Apple Watch sales beyond saying the set a \"new quarterly record.\" and were \"especially strong\" in December. The device hit the market in April. Apple shares rose less than 1 percent to $100.04 in after-hours trading. RBC analyst Amit Daryanani noted the March forecast, while below the average number expected by analysts, \"will be perceived positively given rather difficult compares they had [versus the] iPhone 6 cycle.\" Update at 1:45 p.m. PT: Addsdetails about iPad and Mac sales. Update at 1:55 p.m. PT: Adds analyst comments. Updates from 4:20 p.m. PT to 5 p.m. PT: Adds comments from conference call.",
            "Apple posted its slowest growth in iPhone sales since its 2007 introduction ofthe smartphone, and forecast that revenuein the current quarter would fall for the first time in over a decade. The Cupertino technology giant said it shipped 74.8 million iPhones in its fiscal first quarter, a modest 1 percent improvement over a year ago December, when it sold 74.5 million smartphones. Analysts have beensaying for monthsthat Apple would have trouble matching  let alone surpassing  last holiday seasonsrecord sales of the iPhone 6 and 6 Plus, which tapped into pent-up consumer demand for big-screen smartphones. Researchers, including Strategy Analytics and IDC, predicted Apples first-quarter worldwide shipments would fall short. Apple still remains heavily dependent on the performance of its smartphones, which account for more than 60 percent of its revenue. New products, such as the Apple Watch, have been slow to take off, and established products such as the iPad have been in decline for the last two years. The December quarters results also were impacted by a cooling Chinese market, which has emerged as Apples second largest, behind the Americas. Sales were up a modest 14 percent compared to a year ago. Overall, Apple reported record earnings of $18.4 billion, or $3.28 per share, on record revenue of $75.9 billion for its fiscal first quarter. Earnings exceeded analyst forecasts of $3.23 per share. The sales fell within Apples guidance, but short of Wall Streets projections of $76.6 billion for the quarter. Apple said it expects revenue of between $50 billion and $53 billion for its March quarter. Thats below Thomson Reuters consensus estimates of $55.7 billion.",
            "A visitor photographs a red Apple logo with an iPhone at the Apple Store on December 1, 2014 in Berlin, Germany. On World AIDS Day, December 1, Apple is donating a portion of sales at the company's retail and online stores around the world to a global fund to fight the disease. In addition, for the following two weeks, the company, in cooperation with the brand Product Red, also known as (RED), will offer 25 apps for sale whose proceeds will go directly to the initiative. (Photo by Adam Berry/Getty Images for Apple) ORG XMIT: 525873599 ORIG FILE ID: 459774380 (Photo: Getty Images for Apple) SAN FRANCISCO  Apple is entering a new slow-growth era of iPhone sales. The company sold 74.8 million iPhones for the last three months of 2015  up less than 1% from the same quarter a year ago, marking the slowest increase for the device since it was introduced in 2007 and slightly under the 75.5 million forecast by analysts. Apple CEO Tim Cook warned of a tough beginning to 2016, including a year-over-year decline in iPhone unit shipments for the current quarter. The financial report and subsequent comments from Cook during a conference call sent Apple shares down 2% in after-hours trading. Apple's fiscal first-quarter results for the three-month period ended Dec. 26 were brisk, as they usually are during the holiday shopping season. Its iPhone franchise contributed mightily to $75.9 billion in revenue, which rose 2% from a year ago, but fell short of $76.5 billion forecast by analysts polled by S&P Capital IQ. Earnings for the just-completed quarter were $3.28 per share, compared with $3.06 a year ago, and topping forecasts of $3.23 a share. Cook said that the January-to-March quarter will be rough, indicating slackening iPhone growth. He estimated sales of $50 billion to $53 billion for the current quarter, short of the $55 billion forecast by analysts. \"Economic challenges are all over the world,\" Cook said in a conference call after the results were announced, emphasizing \"extreme conditions\" in several countries. But he said Apple had performed ably, noting a 14% increase in year-over-year revenue in China, and an increase in Android users who switch to iPhone. The rub, however, is that jittery investors, pounded by a wobbly market and squishy global IT spending forecasts, are worried how iPhone 6S and 6S Plus sales will hold up in the first half of 2016. A Nikkei report said production of the models was down 30% in the January-to-March quarter. Worldwide IT spending will improve a scant 0.6% to $3.54 trillion this year, from $3.52 trillion in 2015, according to market researcher Gartner. Apple's other major products took a thumping during the quarter: iPad sales declined to 16.1 million units shipped from 21.4 million a year ago, and Macintosh sales slid 5% to 5.3 million. Yet the lure of Apple products and its sterling brand name remains irresistible to many. The Cupertino, Calif., company says it sold a record $1.1 billion in the App Store during the weeks of Christmas and New Year's Day. Apple was the only PC manufacturer among the top five to post year-over-year improvement in sales, Gartner says. Apple's share of U.S. smartphone sales improved to 43.3% in 2015, according to eMarketer. (Android remains tops, at 51.7%.) And there are 1 billion active Apple devices worldwide, counting iPhones, iPads and Macs. And many analysts anticipate blockbuster sales of iPhone 7, likely to land in September. Apple's premium pricing has also afforded it a vast pile of cash reserves  $216 billion and climbing  which gives it flexibility few companies enjoy. Apple is leveraging that loyalty, with premium pricing, \"to be dominate in profit share rather than market share,\" says David Rogers, who teaches digital strategy at Columbia Business School. But with intensifying competition and economies in flux, it remains unclear how long Apple will enjoy such an advantage, say marketing experts. Follow USA TODAY San Francisco Bureau Chief Jon Swartz @jswartz Read or Share this story: http://usat.ly/1RLVYrP",
            "Image copyright Getty Images Apple has reported the slowest growth in iPhone sales since the product's 2007 launch and warned sales will decline later this year. The US tech giant sold 74.8 million iPhones in its fiscal first quarter, compared with 74.5 million a year ago. Apple said revenue for the next quarter would be between $50bn (34bn; 46bn) and $53bn, below the $58bn it reported for the same period a year ago. This would mark Apple's first fall in revenues since it launched the iPhone. Despite first-quarter iPhone sales being below the 75 million expected by analysts, it was still a record quarter for the company. Apple revenue in the three months to 26 December was $75.9bn and net profit was $18.4bn, both of which are the highest ever recorded by the company. Sales of iPhones accounted for 68% of the company's revenue in the period. Image copyright Reuters Apple boss Tim Cook credited \"all-time record sales of iPhone, Apple Watch and Apple TV\" for the performance. But the firm's chief financial officer, Luca Maestri, said the company was operating in \"a very difficult macroeconomic environment\". He added that \"iPhone units will decline in the quarter\" and that the company was not projecting beyond those three months. Chinese 'softness not seen before' Apple's sales in Greater China - defined by the company as China, Hong Kong and Taiwan - rose 14%, but that was much slower than the 70% increase a year ago. Mr Maestri said the softness in China was \"something that we have not seen before\", Reuters reported. China accounts for almost a quarter of Apple's sales, more than all of Europe combined. Apple's shares were down 1.8% in after hours trading at $98.20. Daniel Ives, an analyst at Capital Markets, said given the \"white knuckles fears\" ahead of the results, he would \"characterise the overall headline performance as better than feared\".",
            "Even Apple Inc. (Nasdaq:AAPL) isn't immune to a slowing smartphone market. Despite setting a new all-time quarterly profit record for any U.S. public company up 2 percent from last year, the electronics giant failed to meet Wall Street expecations with its latest smartphone, the iPhone 6S, let alone its other core products, the iPad and Mac. Apple posted earnings of $18.4 billion on $75.9 billion revenue, beating consensus projections of $18.22 billion profit but falling short or a projected $76.67 billion in revenue, according to analysts polled by Thomson Reuters. This compares to the $18 billion profit on $74.6 billion in revenue made during the same period last year. Apples revenue fell on the low side of its October guidance, which placed revenue expectations between $75.5 billion and $77.5 billion. Photo: Reuters/Robert Galbraith More worrisome: iPhone sales were essentially flat with last year, the first time sales have not grown since the first iPhone in 2007, meaning the incremental upgrades given the iPhone 6s weren't enough to grow sales. Apple sold 74.78 million iPhone units sold during the all-important holiday quarter compared to the 74.5 million during the same period last year. Wall Street expected upwards of 76.5 million units shipped during the period, according to consensus estimates from analysts polled by Fortune. As might be expected, Apple CEO Tim Cook focused on the positive: Our team delivered Apples biggest quarter ever, thanks to the worlds most innovative products and all-time record sales of iPhone, Apple Watch and Apple TV, Cook said in a statement. The growth of our Services business accelerated during the quarter to produce record results, and our installed base recently crossed a major milestone of one billion active devices. With iPhone growth slowing, analysts expect unit sales to go into negative growth territory for the first time later this year, in part due to murmurs from Apple's supply chain about reduced iPhone 6S orders. Slowing growth in Chinas smartphone market has also stoked investor concerns. For 2015, the Chinese smartphone shipment is expected to slow to 1.2 percent, down from 19.7 percent in 2014, according to IDC estimates. But despite their fears, Greater China continues to be a large revenue driver for Apple accounting for $18.4 billion in revenue, up 14 percent from the $16.14 billion the region drew in for the company last year. That being said, the segment is still one of the largest revenue markets for Apple, second only to the Americas. Photo: Chris Ratcliffe/Bloomberg via Getty Images Apple is reportedly looking into a number of new revenue sources, such as a streaming live television service and an electric car. But at least for now, neither of the two products are expected to debut in the short term. Apple's vehicle project, codenamed Titan, isnt anticipated to materialize before 2019 at the earliest. In the meantime, analysts and investors are keeping a close eye on Apples next full smartphone redesign  the iPhone 7  which anticipated to launch sometime in the second half of 2016. The Apple growth story will be tied to iPhone for the foreseeable future and especially over the next 12 to 18 months, said Daniel Ives, managing director at FBR capital markets. The stock is so reliant on what's going to happen with iPhone 7. Despite short-term fears from Wall Street, several analysts still perceive Apples stock to be highly undervalued and have set their price targets accordingly, such as RBC Capitals $130 target and Piper Jaffrays $179 target price. Their targets are largely driven by expectations on iPhone 7 sales later this year. But before that happens, Apple is also expected to launch a 4-inch iPhone in March, which may be called the iPhone 5se. As for the rest of Apples products, Macs fell short in the period with sales reaching 5.3 million units, down 4 percent from the 5.52 million units sold last year. Even Apple has been affected by a global PC market that has continued to shrink, according to IDC. Its tablet line didn't fare any better. Despite the launch of a 12.9-inch iPad Pro in November, the iPad continued to decline in the holiday quarter with sales of 16.1 million units, down 25 percent from 21.42 million units sold in the same period last year. That compares to Wall Street expectations of about 18 million units for the period. As with previous quarters, Apple has tucked away the Apple Watch and its Apple TV into the Other products category, which grew to $4.35 billion, a 62 percent increase from $2.69 billion a year prior. Apples fiscal 2016 second quarter guidance places revenue between $50 billion and $53 billion, and gross margins between 39 and 39.5 percent. Its estimate comes in below Apples fiscal 2015 second quarter revenue of $58 billion. The next dividend of 52 cents a share will be payable on Feb. 11 to shareholders of record as of close of business on Feb. 8.",
            "Apple shares are down 30% from last year's highs. That's just one of the challenges facing the company. (Photo: AP) Apple iPhone sales were flat for first time in the holiday quarter--Jefferson Graham reports. This is our live blog of Apple earnings call. 2:56 CitiBank analyst asks about macro economic situation. Is it time to go beyond premium pricing? \"Our strategy is to make the best products,\" says Cook. \"For smartphone market we have several different price points for our customers. I don't see us deviating from that approach.\" 2:51 p.m. An analyst asks about iPhone upgrades. How many have done it? Cook says 40% of the Apple base has upgraded to the new 6 or 6S phones. 2:47 Drexel analyst asks about next leg of growth in China and investing in India. For China, \"the LTE penetration as of October was in the mid-20s. There's an enormous upgrade cycle there. The middle class in China was less than 50 million people in 2010, and by 2020 it's projected to be half a billion. We think this provides us a great opportunity to win over some of those customers. The demographics are great. We're on target to have 40 stores in China by summer. We remain very bullish on China and don't subscribe to the doom and gloom predictions.\" India is \"very exciting. It's growth is very good. Third largest smartphone market in the world, after China and the United States. Almost half of the people in India are under 25. The demographics are great for a consumer brand, and for people who want the very best products. India revenue was up 38% in the quarter. It's a rapidly expanding country.\" 2:44 Cross Research analyst Shannon Cross asks about research and development. \"We're continuing to invest without pause. We believe in investing through downturns. Our expansion plans in China have not changed. We're also continuing to invest in markets that are great for Apple in the long term, like India. Even in markets that look bleak, like Brazil and Russia, we believe this too shall pass. We're not retrenching. We don't believe in that.\" 2:36 Bernstein analyst asks Cook about the expected iPhone shipment declines in the coming quarter. Is this because the iPhone has peaked and the market is saturated? Cook: \"We do think iPhone units will decline in the quarter. We aren't projecting beyond the quarter, but we see that Q2 is the toughest compare, because the year ago quarter also had catch-up in it from Q1. We were supply constrained from Q1. We're in an environment that's totally different from a macro economic view. The overall malaise in virtually every country in the world.\" On saturation, the \"metrics I see would strongly suggest otherwise,\" from the analyst's saturation question. \"Almost half of the iPhones we sold in China last quarter were to people buying their first iPhone.\" 2:30 Gene Munster from Piper Jaffray asks Apple CEO Tim Cook about the iPhone upgrade program, and how it worked. He also wants to know what he thinks of virtual reality. \"We were blown away by the number of Android switchers we had in last quarter. We see that as a huge opportunity.\" Over time, the upgrade program will be meaningful, he added. For VR, \"I don't think it's a niche. It's really cool and has some interesting applications. 2:27 p.m. Question from Goldman Sachs analyst about guidance. Maestri says in constant currency, revenue would be down 5-10%. Macro environment is weakening, he added. \"Clearly the economy is significantly weaker than it was a year ago,\" he said, referring to Brazil, Russia and other companies. Apple has responded by raising the prices on products, but they effect demand as well. 2:20 On the call, Apple's senior vice-president Luca Maestri is reciting numbers from around the world. Mac sales are down 4%, he said. iPad sales 16 million, compared to 21 million in year ago quarter. So Mac and iPad are both down. Maestri reads guidance--between $50 to $53 billion. A wider range than usual, he said, because of the uncertainty of international markets. March will be the most difficult quarter of the year, he added. 2:00 PT: APPLE CEO Tim Cook opens the call and speaks. He begins by announcing the numbers and saying that international dollar valuations have been challenging for the company. \"The movement has been dramatic.\" But best numbers ever in China for the quarter, he said. But he started to see slowness in China in December. \"We remain very confident in long term potential,\" for the Chinese market. \"Apple remains incredibly strong,\" he added. \"We are very optimistic about our business.\" In last quarter, Apple introduced a revamped Apple TV, larger iPad and the new iPhone 6S. Set a quarterly record for Apple Watch sales, but he didn't reveal numbers. Cook said there are 1 billion Apple iPhone and iPad devices in use. Apple's quarterly results: revenue of $75.9 billion and net income of $18.4 billion, or $3.28 per diluted share. That is slightly on par with analysts expectations, who projected revenues of $76 billion, or $3.23 a share. In the year ago quarter, Apple reported revenues of $74.599 billion. But for the quarter, Apple said it sold 74.8 million iPhones, which is slightly lower--0.4%, than the year-ago quarter, and the first time Apple didn't seriously grow the iPhone brand with a new edition. Apple stock closed up 55 cents Tuesday, at $99.99. Here's thoughts from Apple analyst Daniel Ives: \"Apple delivered revenue of $75.9 billion vs. the Street at $76.7 billion and guidance of $75.50-$77.50 billion. EPS of $3.28 vs. the Street at $3.23, gross margins were 40.1% vs. the Street at 39.9%. Overall given the white knuckles fears going into this print, we would characterize the overall headline performance as better than feared. -the main focus will be Apples iPhone unit number of 74.5 million vs. the Street at 75.5 million. Holiday sales were telegraphed to be good through the supply chain checks, but not great and these results support Street sentiment heading into the print. Greater China was up 14% year over year and 50% sequentially which speaks to strength on this number despite macro headwinds. Overall, there were draconian fears heading into this print and we would view this a small step in the right direction given bear sentiment on the name. Cook and Apple have some more wood to chop over the coming quarters to give investors further confidence in the potential mega cycle around iPhone 7. -The Street was bracing for a weak March guide and Cook ripped the band-aid off with a $50 billion to $53 billion estimate vs. the Street at $55.6 billion. The Street was fearing a sub $50 billion guide so we would characterize this as a B- guidance with fears of a C in the cards. -Overall, the near-term period it will be choppy into March/June but Cook & Co. need to give investors something to hang their hat on which is all around iPhone 7 later this year. Its a groundhog day from 5s to iphone 6-thats the bull thesis heading into iPhone 7. Investors will be laser focused on China growth into 2016, Apple Watch sales which looked to have a good holiday season and showed some life, and what/if any plans Apple has for its $200 billion+ of cash sitting in its treasure chest. \" Gene Munster, Piper Jaffray: \"Now that the March and June iPhone numbers have been reset, we believe investors will have more confidence to invest in AAPL in anticipation of catalysts in mid- and late-2016. The irony of the weak iPhone numbers in 2016 is it of course makes the comps easier next year. We expect Apple will increase its capital distribution program when it reports the March quarter in April. While we believe that this is largely expected by investors, we still feel that it has the chance to be a mild positive nonetheless. Beyond the March quarter, we expect the multiple on shares of AAPL to expand in anticipation of the full cycle iPhone 7 in September (will potentially have a slightly larger screen with the removal of the home button along with a new smaller 4\" iPhone). Additionally, we expect the favorable impact of the iPhone Upgrade Program, which will first help the Dec-16 quarter and ramp from there, will be a growing theme with investors. As a reminder, we believe the iPhone Upgrade Program and US carriers selling iPhones with an annual upgrade option should improve the pace of iPhone upgrades from 22 months to 15 months in the US. We believe that as this program gets rolled out internationally (Apple has announced it will be available outside the US, but has not given timing), it could add an incremental 3-5% to iPhone unit growth for several years starting in 2017. Lastly, AAPL's multiple has expanded ~30% in anticipation of a full iPhone for the last two full cycle launches (iPhone 5, iPhone 6) with an average multiple in September of ~15x vs the current out year multiple of 10x CY17E EPS. In March, Apple is expected to unveil a new addition to the iPhone lineup, with a smaller screen for those who think the current 4.7 inch and 5.5 inch iPhones are too large. The company is also expected to bring out the second edition of the Apple Watch. Of all the new Apple products in recent times, the Apple Watch didn't turn into a blockbuster, with analysts pegging sales at anywhere between 10 to 20 million units. Read or Share this story: http://usat.ly/1VoUPEx"
            ],
  "common_words": [
                   "apple",
                   "revenue",
                   "million",
                   "sale",
                   "iphone",
                   "quarter"
                   ],
  "top_image": {
  "low": "http://i68.servimg.com/u/f68/13/85/87/18/27appl10.jpg",
  "original": "http://static01.nyt.com/images/2016/01/27/technology/27apple-web/27apple-web-facebookJumbo.jpg"
  }, "summary": [
                 "Apple on Tuesday said that it sold 74.8 million iPhones in its fiscal first quarter, which ended Dec. 26, up less than 1 percent from the 74.5 million sold a year ago.",
                 "Overall, Apple reported record earnings of $18.4 billion, or $3.28 per share, on record revenue of $75.9 billion for its fiscal first quarter.",
                 "Of all the new Apple products in recent times, the Apple Watch didn't turn into a blockbuster, with analysts pegging sales at anywhere between 10 to 20 million units.",
                 "(Photo: AP) Apple CEO Tim Cook presented his take on the company's quarterly results in a conference call with analysts.",
                 "He estimated sales of $50 billion to $53 billion for the current quarter, short of the $55 billion forecast by analysts.",
                 "Almost half of the iPhones sold in China in the December quarter were to people buying their first smartphone, and Apple also sees opportunities in other emerging markets.",
                 "Overall given the white knuckles fears going into this print, we would characterize the overall headline performance as better than feared.",
                 "Image copyright Getty Images Apple has reported the slowest growth in iPhone sales since the product's 2007 launch and warned sales will decline later this year."
                 ],
  "tweets": [
             {
             "id": 692219496229126146,
             "text": "Amazing that Apple sells 75 million iPhones in ONE QUARTER but that's now not enough to remain a Wall Street darling https://t.co/e6NxAtG5mJ",
             "name": "Mark Follman",
             "username": "@markfollman",
             "blockquote": "",
             "link":"https://twitter.com/markfollman/status/692219496229126146"
             },
             {
             "id": 692102043700445188,
             "text": "Apple reported slowing growth for iPhone sales, with 74.8 million in its first fiscal quarter http://nyti.ms/1lPxGz9",
             "name": "The New York Times",
             "username": "@nytimes",
             "blockquote": "",
             "link":"https://twitter.com/nytimes/status/692102043700445188"
             }
             ],
  "quotes": [
             {
             "person": "Tim Cook",
             "text": "We are seeing extreme conditions unlike anything we have ever experienced before"
             }
             ],
  "products": [
               {
               "name": "iPhone 6s",
               "source_name": "wikipedia",
               "source_url": "https://en.wikipedia.org/wiki/IPhone_6S",
               "text": "The iPhone 6S and iPhone 6S Plus (stylized as iPhone 6s and iPhone 6s Plus) are smartphones designed by Apple Inc. The devices are part of the iPhone series and were announced on September 9, 2015, at the Bill Graham Civic Auditorium in San Francisco by Apple Inc. CEO Tim Cook"
               }
               ],
  "companies": [
                {
                "name": "Apple",
                "source_name": "wikipedia",
                "source_url": "https://en.wikipedia.org/wiki/Apple_Inc.",
                "text": "Apple Inc. is an American multinational technology company headquartered in Cupertino, California, that designs, develops, and sells consumer electronics, computer software, and online services."
                }
                ],
  "people": [
             {
             "name": "Tim Cook",
             "source_name": "wikipedia",
             "source_url": "https://en.wikipedia.org/wiki/Tim_Cook",
             "text": "Timothy Donald \"Tim\" Cook (born November 1, 1960) is an American business executive, and is the chief executive officer of Apple Inc.",
             "photo": "https://upload.wikimedia.org/wikipedia/commons/d/d5/Tim_Cook_2009_cropped.jpg",
             "twitter": "http://twitter.com/timcook"
             }
             ],
  "organizations": [],
  "locations": [
                "Cupertino, California"
                ]
  },
  {
  "_id": "1453985456",
  "_rev": "3-7a7403308c0ce89ef34c1fc556855ed4",
  "articles": [
               {
               "origin": {
               "url": "http://www.engadget.com/rss.xml",
               "name": "engadget"
               },
               "timestamp": 1454013900,
               "top_image": {
               "original": "http://o.aolcdn.com/dims5/amp:c480d5b2efdd9d61f521179cb6a9bbae40cbc358/r:960,504,min/c:960,504,0,3/q:80/?url=http%3A%2Fo.aolcdn.com%2Fdims-shared%2Fdims3%2FGLOB%2Fcrop%2F1200x693%2B0%2B0%2Fresize%2F1400x809%21%2Fformat%2Fjpg"
               },
               "link": "http://www.engadget.com/2016/01/28/microsoft-q2-2016-earnings/",
               "title": "Microsoft's Surface sales up 29 percent, phones down 49 percent"
               },
               {
               "origin": {
               "url": "http://rssfeeds.usatoday.com/usatoday-TechTopStories",
               "name": "usatoday"
               },
               "timestamp": 1453990373,
               "top_image": {
               "original": "http://www.gannett-cdn.com/-mm-/a8d9af053545606d8fb92b11c0e97dac9e6e8dc8/c=0-105-1022-682&r=x633&c=1200x630/local/-/media/2016/01/26/USATODAY/USATODAY/635894318529279282-msft.JPG"
               },
               "link": "http://rssfeeds.usatoday.com/~/134869243/0/usatoday-techtopstories~Microsoft-earnings-anchored-to-cloud-Office/",
               "title": "Microsoft earnings anchored to cloud, Office 365"
               },
               {
               "origin": {
               "url": "http://rssfeeds.usatoday.com/usatoday-TechTopStories",
               "name": "usatoday"
               },
               "timestamp": 1454012458,
               "top_image": {
               "original": "http://www.gannett-cdn.com/-mm-/8fb3b70abdb1d434cc6c44895b7a6bcf20334ea8/c=0-195-1024-773&r=x633&c=1200x630/local/-/media/2016/01/28/USATODAY/USATODAY/635895870621747348-nadell.JPG"
               },
               "link": "http://rssfeeds.usatoday.com/~/135095175/0/usatoday-techtopstories~Microsoft-beats-the-Street-on-cloud-Windows-growth/",
               "title": "Microsoft beats the Street on cloud, Windows 10 growth"
               },
               {
               "origin": {
               "url": "http://www.ibtimes.com/rss/technology",
               "name": "ibtimes"
               },
               "timestamp": 1454013772,
               "top_image": {
               "original": "http://s1.ibtimes.com/sites/www.ibtimes.com/files/2016/01/28/gettyimages-491566280.jpg"
               },
               "link": "http://www.ibtimes.com/microsoft-corporation-msft-q2-2016-earnings-revenue-beats-street-strong-surface-2284867",
               "title": "Revenue Beats Street On Strong Surface, Office 365 Sales"
               },
               {
               "origin": {
               "url": "http://recode.net/feed",
               "name": "recode"
               },
               "timestamp": 1454012600,
               "top_image": {
               "original": "https://recodetech.files.wordpress.com/2015/12/20151216-microsoft-sign.jpg"
               },
               "link": "http://recode.net/2016/01/28/microsoft-earnings-top-estimates-on-strong-cloud-business/",
               "title": "Microsoft Earnings Top Estimates on Strong Cloud Business"
               },
               {
               "origin": {
               "url": "http://feeds.feedburner.com/TechCrunch",
               "name": "techcrunch"
               },
               "timestamp": 1454011923,
               "top_image": {
               "original": "https://tctechcrunch2011.files.wordpress.com/2014/04/microsoft-earnings.jpg"
               },
               "link": "http://feedproxy.google.com/~r/Techcrunch/~3/W0ZTqiWFPqc/",
               "title": "Microsoft Beats With $25.7B Revenue, $0.78 EPS"
               },
               {
               "origin": {
               "url": "http://feeds.venturebeat.com/VentureBeat",
               "name": "venturebeat"
               },
               "timestamp": 1454011874,
               "top_image": {
               "original": "http://1u88jj3r4db2x4txp44yqfj1.wpengine.netdna-cdn.com/wp-content/uploads/2015/08/microsoft-780x355.jpg"
               },
               "link": "http://venturebeat.com/2016/01/28/microsoft-sees-25-7-billion-in-q2-2016-revenue-1-3-billion-generated-by-surface/",
               "title": "Microsoft sees $25.7 billion in Q2 2016 revenue, $1.3 billion generated by Surface"
               },
               {
               "origin": {
               "url": "http://feeds.nytimes.com/nyt/rss/Technology",
               "name": "nytimes"
               },
               "timestamp": 1454023275,
               "top_image": {
               "original": "http://static01.nyt.com/images/2016/01/29/technology/29microsoft-web/29microsoft-web-facebookJumbo.jpg"
               },
               "link": "http://www.nytimes.com/2016/01/29/technology/microsoft-earnings.html?partner=rss&emc=rss",
               "title": "Microsoft Profit and Revenue Fall, but Cloud Computing Grows"
               },
               {
               "origin": {
               "url": "http://www.ibtimes.com/rss/technology",
               "name": "ibtimes"
               },
               "timestamp": 1453985456,
               "top_image": {
               "original": "http://s1.ibtimes.com/sites/www.ibtimes.com/files/2016/01/27/gettyimages-499611466.jpg"
               },
               "link": "http://www.ibtimes.com/microsoft-corporation-msft-q2-2016-earnings-preview-can-windows-surface-office-365-2283017",
               "title": "Microsoft Corporation (MSFT) Q2 2016 Earnings Preview"
               },
               {
               "origin": {
               "url": "http://feeds.bbci.co.uk/news/technology/rss.xml",
               "name": "bbc"
               },
               "timestamp": 1454051784,
               "top_image": {
               "original": "http://ichef-1.bbci.co.uk/news/1024/cpsprodpb/119D4/production/_87984127_gettyimages-459885938.jpg"
               },
               "link": "http://www.bbc.co.uk/news/business-35433162#sa-ns_mchannel=rss&ns_source=PublicRSS20-sa",
               "title": "Microsoft shares boosted by growth in cloud services"
               }
               ],
  "images": [
             "http://www.gannett-cdn.com/-mm-/ae30453a4259521722cda7188e2bf84af9a33856/c=59-0-965-681&r=x408&c=540x405/local/-/media/2016/01/26/USATODAY/USATODAY/635894327817385896-ljlkj.JPG",
             "https://recodetech.files.wordpress.com/2015/12/20151216-microsoft-sign.jpg?quality=80&strip=info&w=1280",
             "https://tctechcrunch2011.files.wordpress.com/2016/01/2016-01-28_1326.png?w=1188&h=718"
             ],
  "texts": [
            "On the whole, it wasn't a great holiday quarter for Microsoft. Its revenues fell around 10 percent from last year (from $26.5 billion to $23.8 billion), while its net income fell around 15 percent (from $5.8 billion to $5 billion). Still, the company saw strong cloud growth, with Azure revenue up by 140 percent. Its overall Intelligent Cloud division revenue was up five percent. There were some pretty big gains in other categories, as well. Office 365 revenue jumped 70 percent compared to last year, for example, and it also reached 20.6 million customers. On the gaming front, Microsoft says it now has 48 million monthly active users (people who sign on at least once a month), an increase of 30 percent. Developing...",
            "Microsoft CEO Satya Nadella, shown here at the recent Davos World Economic Forum, is in the midst of leading the storied tech company through a major turnaround. (Photo: Jean-Christophe Bott, EPA) SAN FRANCISCO  It may take the rest of 2016 to yield the fruits of CEO Satya Nadella's turnaround labor, but some results should be apparent in its upcoming earnings report. The Redmond, Wash-based tech giant will report its fiscal second-quarter results after the bell on Thursday, anticipated to be 71 cents earnings per share on $25.2 billion in revenue, according to analyst consensus reports from S&P Capital IQ. Bernstein analyst Mark Moerdler is forecasting Street-beating EPS of 75 cents, anchored to continued momentum from Microsoft's Azure cloud services and a gradual turnaround in Windows and Office 365 revenue. Roadblocks would include lower than expected guidance for the next quarter. \"This is an important risk to consider given that estimates for Microsoft's Q3 results have come up and the company has a tendency to guide very conservatively (and) as with any quarter for Microsoft, there are always unknown unknowns,\" Bernstein wrote in his analyst note. Under Nadella, Microsoft has been feverishly reinventing itself from an isolated licensing fee-anchored enterprise to a more nimble and technologically adventurous company. Nadella spent much of 2015 shedding bad investments such as handset manufacturer Nokia, forging partnerships with would- be rivals such as Salesforce and challenging employees to help the company innovate. More evidence of this expansive mindset came with recent news that the company would be purchasing its leased Silicon Valley properties, with plans for a 50% growth in Bay Area employees. Microsoft's stock has risen nearly 25% year over year, outpacing the Nasdaq Composite Index's 6.9% 2015 gain. In Thursday trading, the stock was up 1% to $51.73. This upward stock trajectory would seem to justify the more than $100 million in cash and stock Nadella has made since taking the reins in February of 2014. Daniel Ives of FBR Capital Markets says he's expecting \"a slight beat, but no fireworks\" for the most recent quarter. He calls the cloud the epicenter of Microsoft (MSFT) growth for 2016 and beyond. \"Over the next 12 months, I'd like to see cloud hit a $9 or $10 billion annual run rate from the current $8 billion,\" Ives says. \"Windows 10 has been a big success (on 100 million devices since its release last summer), but now it's about a conversion to revenue this (calendar) year.\" Microsoft's Azure cloud is second only to Amazon's AWS (Amazon Web Services) in the burgeoning space, a $16 billion annual computer-storage rental proposition. AWS has an estimated 30% of market share to Microsoft's 10%, although Microsoft's year over year growth rate of 96% tops AWS's 51%, according to Synergy Research Group. IBM, Google and Salesforce round out the top five. Microsoft CEO Satya Nadella has helped keep his company in the spotlight through frequent public appearances, including his recent attendance at President Obama's final State of the Union speech. (Photo: Jack Gruber, USA TODAY) \"Azure is a compelling option that is slowly closing the gap on AWS, and I don't see anything taking away from that trend,\" says Gartner Research vice president Adam Woodyer. \"Microsoft is still tied to (shrinking) PC demand, but we do see a gradual decoupling on that front.\" Instead, the push is to grow users on the consumer and enterprise side by providing access points to its services via both mobile and desktop, says Forrester industry analyst Frank Gillett. \"It's going to be about having an account relationship (with Microsoft), so that the company can then engage those customers and make money on services, like extra storage on (Office 365's file sharing platform) OneNote,\" he says. \"The goal is to be with customers wherever they are. Microsoft is mid-course and so far it's looking like a good trajectory. They've gotten themselves out of the question-mark zone.\" Headwinds for Microsoft continue to be the shift away from PCs (75 million PCs shipped out globally in the fourth quarter of 2016, an 8% year-on-year decline, according to Gartner) as well as the ill-effects of a strong dollar (more than half of Microsoft's revenue comes from outside the U.S.). Looming opportunities for the company include its aggressive forays into new technologies such as virtual and augmented reality, says Scott Kessler of S&P Capital IQ. \"Lots of large cap tech companies such as Apple, Alphabet and Amazon, companies with more cash than they know what to do with, are look at the megatrends to see if there are opportunities not to be missed, with VR being one of them,\" says Kessler, noting that Microsoft's well-received HoloLens device should hit consumers this year. \"I don't expect those sorts of things to move the needle financially. But as much as companies are looking for market share, they're also looking for mind share. For the latter, it's important for Microsoft to be seen as a technology leader and innovator.\" Follow USA TODAY tech reporter Marco della Cava on Twitter @marcodellacava. Read or Share this story: http://usat.ly/1RNtI86",
            "Microsoft CEO Satya Nadella, shown here at the company's shareholder meeting in December 2015. (Photo: Stephen Brashear, Getty Images) SAN FRANCISCO - Anchored to continued cloud and other enterprise-focused growth, Microsoft beat Wall Street expectations Thursday with its second quarter earnings report. The Redmond, Wash-based software giant reported adjusted earnings per share of 78 cents against revenue of $25.7 billion, which surpassed S&P Capital IQ analyst consensus estimates of 71 cents earnings per share on $25.2 billion in revenue. The company's stock (MSFT) closed up 1.5% at $52.06, but jumped 5% in after-hours trading to $54.70. Highlights of the quarter include a jump in Microsoft's commercial cloud annualized revenue run rate to $9.4 billion, from $8.2 billion last quarter, and a leap to 200 million devices using Windows 10, up from 110 million last quarter. The company is aiming for a commercial cloud annualized run rate of $20 billion by fiscal year 2018. Microsoft's Azure service is second only to Amazon Web Services in the fight for a $16 billion annual market (Microsoft has 10% share to AWS's 30%). \"Nadella has put Microsoft into a position of strength into 2016 and beyond as cloud, Office 365, and Windows 10 puts fuel in Redmond's growth engine despite a choppy backdrop,\" says Daniel Ives of FBR Capital Markets. \"We believe Microsoft is seeing a generally healthy demand on cloud and core enterprise build-outs and is slowly moving away from the PC environment which clearly has massive headwinds.\" This is Microsoft's sixth straight quarter of EPS beats. The news reaffirms that CEO Satya Nadella, now two years at the helm of a radical company turnaround, has picked the right goals for the onetime software-selling king. Nadella has vowed to reshape Microsoft into a cloud- and mobile-first company aimed at being a leading player in enterprise work solutions, an effort to cast aside a losing model in a mobile age that continues to see declining global PC sales. Follow USA TODAY tech reporter Marco della Cava on Twitter @marcodellacava. Read or Share this story: http://usat.ly/1SMCeEv",
            "Microsoft posted its second-quarter 2016 earnings report Thursday, and shareholders had reason to be pleased. Overall revenue beat analysts' forecasts, and Surfacesales in particularsaw a sharp rise, pushed by the Surface Book and Surface Pro 4. Office 365 nearly doubled its revenue and increasedits consumer subscriber count, while Azure cloud sales were up140 percent. Microsoft posted earnings per share of $0.78, beating analyst expectations of $0.71. The company alsoposted $25.69billion in revenue,surpassing analysts' revenue estimateof $25.26 billion. Net income was $6.3billion. In the same quarter last year, Microsoft posted earnings per share of $0.71, revenue of $26.5 billion and net income of $5.86 billion. The company stock was at $55.50 in early after-hours trading, up 6.62 percent from market close at $52.06. Businesses everywhere are using the Microsoft Cloud as their digital platform to drive their ambitious transformation agendas, said Satya Nadella, chief executive officer at Microsoft, in a statement. Businesses are also piloting Windows 10, which will drive deployments beyond 200 million active devices. Productivity and Business Processes, which includes Office 365, declined 2 percent in revenue, in line with guidance. The operating unit made $6.7 billion in revenue, with Microsoft's prior guidance estimating around $6.6 billion to 6.7 billion. Office 365 revenue grew nearly 70 percent,a sign of Microsoft's success at diversifying away from Windows. \"They used to depend on trapping you in the ecosystem with their operating system, and they've transcended that,\" said Kim Forrest, VP and senior equity analyst at Fort Pitt Capital Group. Intelligent Cloud, which includes the Azure cloud computing platform, grew 5 percentto $6.3billion. In its prior guidance, Microsoft estimated around $6.2 billion to 6.3 billion revenue. Azure revenue alone grew a whopping 140 percent. Sales in Microsoft's personal computing groupdeclined 5 percentto $12.7billion, beatingprior guidance that estimatedaround $12 billion to $12.4 billion in revenue. The unit includes Windows 10, Bing and the Surface line of tablets.Surface revenue grew by 29 percent year over year. \"I've always seen Surface as the showcase of what [Windows 10] hardware can do,\" said Forrest.",
            "Microsoft on Thursday posted fiscal second-quarter results ahead of analysts estimates amid strong results from its cloud business. The company posted $5 billion in net income, or 62 cents per share, on revenue of $23.8 billion. Excluding certain items, the company reported income of $6.3 billion, or 78 cents per share, on adjusted revenue of $25.7 billion. Analysts were expecting per-share earnings of 71 cents on revenue of $25.2 billion. Microsoft, while often seen as not possessing the cool factor of Google and Apple, has nonetheless continued to top expectations in recent quarters amid strong sales to businesses. The company said it will provide financial outlook when it holds a conference call with analysts later on Thursday. It was a strong holiday season for Microsoft, highlighted by Surface and Xbox, Chief Operating Officer Kevin Turner said in a statement. Our commercial business executed well as our sales teams and partners helped customers realize the value of Microsofts cloud technologies across Azure, Office 365 and CRM Online. CEO Satya Nadella said business testing of Windows 10 should help the operating system to be running soon on 200 million devices. The company has set a goal of having a billion devices running the software in a couple years time. Shares rose in after-hours trading, changing hands recently at $55.46, up $3.40 or more than 6 percent. Among other highlights, Microsoft noted that: * Windows revenue from computer makers dropped 5 percent, though that was less than overall PC market decline * Nearly 30 percent of search revenue in December was driven by Windows 10 * Microsofts devices business saw mixed results as Surface revenue increased 29 percent in constant currency, while phone revenue fell by nearly half.",
            "Microsoft today reported earnings for its second financial quarter of 2016 (I know, thats weird, but Microsofts financial year ends in June). The company reported non-GAAP revenue of $25.7 billion for the last quarter and $0.78 of adjusted per-share profit. In the year-ago quarter, the company reported revenue of $26.5 billion and earnings of $0.71. Wall Street expected Microsoft to deliver an EPS of $0.71 on revenue of $25.26 billion. Businesses everywhere are using the Microsoft Cloud as their digital platform to drive their ambitious transformation agendas, said Satya Nadella, chief executive officer at Microsoft. Businesses are also piloting Windows 10, which will drive deployments beyond 200 million active devices. Last quarter, Microsoft broke out results for its different business units for the first time and thankfully, the company didnt make any changes to this process this time around. Here is what its results look like when we break them down by business unit. Productivity and Business Processes (PBP), including Office, consumer Office, and Dynamics: $6.7 billion compared to $6.3 billion in revenue last quarter. Office 365 now has 20.6 million subscribers. Intelligent Cloud (IC), which includes service revenue and Enterprise Services: $6.4 billion compared to $5.9 billion in the last quarter. More Personal Computing (MPC), which contains Windows, Devices, Gaming and Search: $12.7 billion. Last quarter, the company reported $9.4 billion in revenue for this group. This was largely driven by increased sales of Microsofts surface line, though phone revenue expectedly declined by 49 percent. Last quarter, Microsoft also announced that its commercial cloud business was on an $8.2 billion annual run rate, up from $8.2 billion in its last financial quarter of 2015. This quarter, the company updated this number to $9.4 billion. Microsoft has previously said that it expects this number to hit $20 billion by 2018.",
            "Microsoft today reported earnings for its second fiscal quarter of 2016, including revenue of $25.69 billion and earnings per share of $0.78. Analysts had expected the company to earn $25.26 billion in revenue and earnings per share of $0.71. Microsofts stock was up 1.63 percent in regular trading. In after-hours, however, the company is up another 5 percent. Last quarter, Microsoft started reported earnings by breaking down its results into three operating groups, plus a Corporate and Other section. Well look at each more closely to see how the company fared. Productivity and Business Processes This segment, which includes results from Office and Office 365 (commercial and consumer customers), declined 2 percent to $6.7 billion. Office 365 had a decent quarter, adding 2.4 million subscribers to hit 20.6 million. Office commercial products and cloud services revenue grew 5 percent with Office 365 revenue growth of nearly 70 percent. At this point, steady Office 365 growth is not much of a surprise. The company is slowly but surely converting its traditionally most lucrative software business into a subscription revenue stream. Intelligent Cloud This segment, which includes results from server products and services (including Windows Server and Azure), grew 5 percent to $6.3 billion. Server products and cloud services revenue grew 10 percent. But the big highlight was Azure revenue, which grew 140 percent, including revenue from Azure premium services growing nearly 3x year-over-year. More Personal Computing This segment, which includes results Windows licensing and devices (Surface, phones, and Xbox), declined 17 percent to $9.4 billion. Microsoft saw Surface revenue jump from $1.10 billion in Q2 2015 to $1.35 billion in Q2 2016. The Surface Pro 4 and the Surface Book seem to be selling well. And yet, we still dont know how many Microsoft is pushing out, as the number includes accessories and older Surface devices. More to follow",
            "Photo Advertisement Continue reading the main story SEATTLE  Satya Nadella has put cloud computing at the center of Microsofts strategy. It is a move that looks to be paying off, at least in the eyes of investors. On Thursday the company said its revenue and profit fell in the last quarter. But it mattered little, as Microsoft made more from cloud computing, and its stock jumped more than 5 percent immediately after the numbers were released. The results underscored the good and bad trends that have come to characterize Microsofts financial results in recent years. On the negative side, there is the floundering personal computer business, which is hurting profits from longtime Microsoft software businesses, especially Windows. On the positive, the companys cloud business keeps growing, giving investors hope that Microsoft will remain relevant for years to come. The success of Microsofts cloud business under Mr. Nadella, its new chief executive, has put the companys stock back in favor with investors. Even with recent anxiety in the stock market, Microsofts shares are up more than 28 percent for the last year, while shares in rivals like Apple, Oracle and IBM have declined by double digits. By most analysts estimates, Microsoft is in second place in the most prominent segment of the cloud services market  in which computer storage and other services in data centers are rented to customers  after Amazon. IBM and Google are next. For its second fiscal quarter, which ended on Dec. 31, the company reported net income of nearly $5 billion, or 62 cents a share, compared with $5.86 billion, or 71 cents a share, during the same period a year earlier. Revenue fell to $23.8 billion, down from $26.47 billion a year ago. The figures in the recent quarter reflected a huge deferral of revenue, almost $1.9 billion, related to Windows 10, the companys latest operating system. Although it collects all the cash up front from selling the software to PC makers and others, accounting rules dictate that the company has to spread its recognition of the money over the life of the product. Without that deferral, Microsoft had $25.69 billion in revenue and 78 cents a share in earnings, better than the average forecast of analysts surveyed by Thomson Reuters of 71 cents a share in earnings and $25.26 billion in revenue. Even without the Windows deferral, Microsofts numbers declined from the previous year, in large part because the company in July sharply scaled back the ambitions of its money-losing smartphone business, acquired from Nokia. The companys phone revenue plummeted 49 percent when excluding foreign currency fluctuations as a result of the changes, which included cutting the number of smartphones it sells. Microsofts cloud business encouraged investors. The companys intelligent cloud group, which includes its Azure service, rose 5 percent to $6.3 billion. It now has 20.6 million consumer subscribers to Office 365, the cloud version of its productivity applications, up from 9.2 million a year earlier. Advertisement Continue reading the main story Advertisement Continue reading the main story Last July, Microsoft introduced Windows 10, raising some hope in the industry of a rebound in PC sales. That rebound has not materialized yet. Global shipments of new PCs declined 8.3 percent during the fourth quarter compared with a year earlier, the research firm Gartner recently reported. The revenue Microsoft gets from PC makers for Windows declined 5 percent in the quarter, excluding foreign currency impacts. Revenue from its own Surface line of computers and tablets rose to $1.35 billion from $1.1 billion a year earlier. The company no longer charges most customers to upgrade existing computers to Windows 10, hoping to get as many people as possible running the latest operating system and wooing developers back to Windows. The company has lost considerable influence among developers, who have gravitated to Apples iOS and Googles Android operating systems. In a phone interview, Amy Hood, Microsofts chief financial officer, said Microsoft was not yet predicting a turnaround in the PC market. Our expectation for the PC market is roughly in line with most analysts, Ms. Hood said. For the next year, we understand the market is not likely to grow, but we can still grow.",
            "Microsoft is set to report its fiscal second quarter 2016 earnings after the bell on Thursday, and Surface, Azure and Office 365 will be key areas investors will lookat tomeasure the company's progress toward reaching CEO Satya Nadella's goal of becoming a \"mobile first, cloud first\" company that is less dependent on Windows for revenue growth. Unlike recent years, analysts aregenerally bullish about thesoftware maker'sprospects. 20market watcherscurrently rate MSFT stock as a \"buy.\" The average stock price target for Microsoft is $58.35, a 12.2 percent increase over the Wednesday opening price of $52.01. Analysts are predicting earnings per share of $0.71 with the average revenue estimateat $25.26 billion. In October 2015, Microsoft issued guidance that predicted total revenue of $24.8 to $25.4 billion. Microsoft has been making big moves in its key strength areas, and there's reason to believe it could report a solid quarter. The Surface line of tablets received major updates in late October, with the launch of the Surface Pro 4 and Surface Book, the latter being Microsoft's first ever laptop. In the second quarter 2015 results, Surface revenue hit $1.1 billion, up 24 percent year-over-year. Surface growth is important, but Microsoft won't be bettingfutureearnings on tabletsjust yet. \"I don't think that they think it's going to be a growth spot in the same way the iPhone drives earnings for Apple,\" said Frank Gillett, analyst at Forrester. The tablet lineis more a showcase that showsthe public what device makers can do with Windows 10. \"It's more like the Mac. It's symbolically important, but not vital to the overall success of the company,\" Gillett said. Windows is still in atransitional period, as the company is giving away its latest release for free to consumers running Windows 7 or 8.1. That doesn't mean investors will be ignoring the company's reported figures, however. But there's still plenty of revenue sources from Windows. Device makers will be buying Windows 10 to install on new computers, enterprise customers will be buying copies and someconsumers simply aren't eligible for the upgrade offer. \"Microsoft's going to be making money off Windows for a long time,\" said David Mitchell Smith, analyst at Gartner. Enterprise could be key to adoption. In December 2015, Windows 10 accounted for 9.96 percent of global desktop operating system usage, taking fourth place behind 8.1, XP and 7, the latter claiming 55.68 percent. Gillett said thatbusinesses are still using Windows 7, having skipped 8, but that may soon change. Half of enterprises will start deploying Windows 10 by the start of 2017, according to a November 2015 report from Gartner. Windows may be what the company is best known for, but Azure and Office 365 are crucial strong points. In the second quarter of 2015, commercial cloud revenue (which includes the two services) grew 114 percent, reaching an annualized revenue run rate of $5.5 billion. The strength of the cloud services are a good sign for Microsoft that the company is able to succeed with services that don't depend on Windows. Azure made headlines with the first technical preview of an Azure Stack based on Ubuntu Linux. On the Office 365 side, Microsoft updated its Office iOS apps to fully support the iPad Pro, showing the company isn't totally betting on Windows phones to find success in the mobile arena. In the latter case, Gillett said that Microsoft could be playing a long game by offering its services on other platforms. The company can hook consumers onto its Office iOS offerings, for example, then tempt them with the prospect of a better integrated experience with a Windows phone.",
            "Image copyright Getty Images Image caption Microsoft chief executive Satya Nadella has been focusing on cloud computing services Microsoft shares rose in after-hours trading as it reported strong growth in its cloud computing and mobile applications divisions. Chief executive Satya Nadella has been focusing on cloud services and revenue for the division rose 5% to $6.3bn. However, profits for the three months to 31 December fell 15% to $5bn (3.4bn) as the strong dollar and falling PC sales took their toll. Total revenue also slipped 10.1% to $23.8bn. Both numbers were better than analysts had expected. NPD Group analyst Stephen Baker said: \"People who think Microsoft is sliding into irrelevancy really need to re-evaluate how they see the company. They are a software-first company in a world that is increasingly about software.\" Matt Howard, a venture capitalist at Norwest Ventures, said Microsoft had \"nailed the cloud\". Mr Nadella said: \"The enterprise cloud opportunity is massive - larger than any market we have ever participated in.\" Microsoft's combined cloud business, which also includes other divisions such as Office 365, was on track for $9.4bn in annual revenue - higher than its previous forecast of $8.2bn. The global cloud storage industry was worth almost $19bn last year, according to Research and Markets. The group estimates that will rise to $65bn by 2020. Microsoft's decision to focus more on cloud services - where its competitors include Amazon, Google, IBM and Cisco - has helped it move away from the declining PC market. Microsoft's revenue from personal computing, which includes the Windows business, fell 5% in the quarter to $12.7bn. Image copyright Getty Images Surface success Global PC shipments fell 10.6% in the fourth quarter compared with the same period in 2014, according to IDC. The research firm said PC sales should improve later this year as companies that had delayed replacing computers ahead of the release of Windows 10 last summer start buying again. Tablet computers were a bright spot for Microsoft, with revenue up 29% following the launch of the Surface Pro 4 and Surface Book. The number of people using the Xbox Live service for digital content and video games climbed 30% to a record 48 million. Shares in Microsoft were up 4.2% to $54.25 in after-hours trading in New York and have risen 10% in the past 12 months."
            ],
  "common_words": [
                   "microsoft",
                   "cloud",
                   "revenue"
                   ],
  "top_image": {
  "low": "http://i68.servimg.com/u/f68/13/85/87/18/gettyi10.jpg",
  "original": "http://s1.ibtimes.com/sites/www.ibtimes.com/files/2016/01/28/gettyimages-491566280.jpg"
  },
  "summary": [
              "The Redmond, Wash-based tech giant will report its fiscal second-quarter results after the bell on Thursday, anticipated to be 71 cents earnings per share on $25.2 billion in revenue, according to analyst consensus reports from S&P Capital IQ.",
              "CEO Satya Nadella said business testing of Windows 10 should help the operating system to be running soon on 200 million devices.",
              "Businesses everywhere are using the Microsoft Cloud as their digital platform to drive their ambitious transformation agendas, said Satya Nadella, chief executive officer at Microsoft.",
              "Intelligent Cloud (IC), which includes service revenue and Enterprise Services: $6.4 billion compared to $5.9 billion in the last quarter.",
              "Microsoft today reported earnings for its second fiscal quarter of 2016, including revenue of $25.69 billion and earnings per share of $0.78.",
              "Productivity and Business Processes This segment, which includes results from Office and Office 365 (commercial and consumer customers), declined 2 percent to $6.7 billion.",
              "The strength of the cloud services are a good sign for Microsoft that the company is able to succeed with services that don't depend on Windows.",
              "Tablet computers were a bright spot for Microsoft, with revenue up 29% following the launch of the Surface Pro 4 and Surface Book."
              ],
  "tweets": [
             {
             "id": 692830082872713216,
             "text": "Sorry, Windows Phone. 110m lifetime sales - 4.5bn iOS & Android phones sold in the same period",
             "name": "Benedict Evans",
             "username": "@BenedictEvans",
             "blockquote": "",
             "link": "https://twitter.com/BenedictEvans/status/692830082872713216"
             },
             {
             "id": 692965162995838976,
             "text": "#Sitecore's Alliance partner, #Microsoft, beats the Street on #Cloud growth http://usat.ly/1SMCeEv ",
             "name": "Jean Paul Gomes",
             "username": "@jeanpaulgomes",
             "blockquote": "",
             "link": "https://twitter.com/jeanpaulgomes/status/692965162995838976"
             }
             ],
  "quotes": [
             {
             "person": "Satya Nadella",
             "text": "Businesses everywhere are using the Microsoft Cloud as their digital platform to drive their ambitious transformation agendas"
             }
             ],
  "products": [
               {
               "name": "Windows 10",
               "source_name": "wikipedia",
               "source_url": "https://en.wikipedia.org/wiki/Windows_10",
               "text": "Windows 10 is a personal computer operating system released by Microsoft as part of the Windows NT family of operating systems. It was officially unveiled in September 2014 following a brief demo at Build 2014."
               }
               ],
  "companies": [
                {
                "name": "Microsoft",
                "source_name": "wikipedia",
                "source_url": "https://en.wikipedia.org/wiki/Microsoft",
                "text": "Microsoft Corporation is an American multinational technology company headquartered in Redmond, Washington, that develops, manufactures, licenses, supports and sells computer software, consumer electronics and personal computers and services."
                }
                ],
  "people": [
             {
             "name": "Satya Nadella",
             "source_name": "wikipedia",
             "source_url": "https://en.wikipedia.org/wiki/Satya_Nadella",
             "text": "Satya Narayana Nadella is an India-born American business executive. He is the current chief executive officer (CEO) of Microsoft.[",
             "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6c/Satya_Nadella.jpg/500px-Satya_Nadella.jpg",
             "twitter": "http://twitter.com/satyanadella"
             }
             ],
  "organizations": [],
  "locations": [
                "Redmond, Washington"
                ]
  }
  ]
