[
 {
 "_id": "1453985456",
 "_rev": "3-7a7403308c0ce89ef34c1fc556855ed4",
 "articles": [
              {
              "origin": {
              "url": "http://www.engadget.com/rss.xml",
              "name": "engadget"
              },
              "timestamp": 1454013900,
              "top_image": {
              "original": "http://o.aolcdn.com/dims5/amp:c480d5b2efdd9d61f521179cb6a9bbae40cbc358/r:960,504,min/c:960,504,0,3/q:80/?url=http%3A%2Fo.aolcdn.com%2Fdims-shared%2Fdims3%2FGLOB%2Fcrop%2F1200x693%2B0%2B0%2Fresize%2F1400x809%21%2Fformat%2Fjpg"
              },
              "link": "http://www.engadget.com/2016/01/28/microsoft-q2-2016-earnings/",
              "title": "Microsoft's Surface sales up 29 percent, phones down 49 percent"
              },
              {
              "origin": {
              "url": "http://rssfeeds.usatoday.com/usatoday-TechTopStories",
              "name": "usatoday"
              },
              "timestamp": 1453990373,
              "top_image": {
              "original": "http://www.gannett-cdn.com/-mm-/a8d9af053545606d8fb92b11c0e97dac9e6e8dc8/c=0-105-1022-682&r=x633&c=1200x630/local/-/media/2016/01/26/USATODAY/USATODAY/635894318529279282-msft.JPG"
              },
              "link": "http://rssfeeds.usatoday.com/~/134869243/0/usatoday-techtopstories~Microsoft-earnings-anchored-to-cloud-Office/",
              "title": "Microsoft earnings anchored to cloud, Office 365"
              },
              {
              "origin": {
              "url": "http://rssfeeds.usatoday.com/usatoday-TechTopStories",
              "name": "usatoday"
              },
              "timestamp": 1454012458,
              "top_image": {
              "original": "http://www.gannett-cdn.com/-mm-/8fb3b70abdb1d434cc6c44895b7a6bcf20334ea8/c=0-195-1024-773&r=x633&c=1200x630/local/-/media/2016/01/28/USATODAY/USATODAY/635895870621747348-nadell.JPG"
              },
              "link": "http://rssfeeds.usatoday.com/~/135095175/0/usatoday-techtopstories~Microsoft-beats-the-Street-on-cloud-Windows-growth/",
              "title": "Microsoft beats the Street on cloud, Windows 10 growth"
              },
              {
              "origin": {
              "url": "http://www.ibtimes.com/rss/technology",
              "name": "ibtimes"
              },
              "timestamp": 1454013772,
              "top_image": {
              "original": "http://s1.ibtimes.com/sites/www.ibtimes.com/files/2016/01/28/gettyimages-491566280.jpg"
              },
              "link": "http://www.ibtimes.com/microsoft-corporation-msft-q2-2016-earnings-revenue-beats-street-strong-surface-2284867",
              "title": "Revenue Beats Street On Strong Surface, Office 365 Sales"
              },
              {
              "origin": {
              "url": "http://recode.net/feed",
              "name": "recode"
              },
              "timestamp": 1454012600,
              "top_image": {
              "original": "https://recodetech.files.wordpress.com/2015/12/20151216-microsoft-sign.jpg"
              },
              "link": "http://recode.net/2016/01/28/microsoft-earnings-top-estimates-on-strong-cloud-business/",
              "title": "Microsoft Earnings Top Estimates on Strong Cloud Business"
              },
              {
              "origin": {
              "url": "http://feeds.feedburner.com/TechCrunch",
              "name": "techcrunch"
              },
              "timestamp": 1454011923,
              "top_image": {
              "original": "https://tctechcrunch2011.files.wordpress.com/2014/04/microsoft-earnings.jpg"
              },
              "link": "http://feedproxy.google.com/~r/Techcrunch/~3/W0ZTqiWFPqc/",
              "title": "Microsoft Beats With $25.7B Revenue, $0.78 EPS"
              },
              {
              "origin": {
              "url": "http://feeds.venturebeat.com/VentureBeat",
              "name": "venturebeat"
              },
              "timestamp": 1454011874,
              "top_image": {
              "original": "http://1u88jj3r4db2x4txp44yqfj1.wpengine.netdna-cdn.com/wp-content/uploads/2015/08/microsoft-780x355.jpg"
              },
              "link": "http://venturebeat.com/2016/01/28/microsoft-sees-25-7-billion-in-q2-2016-revenue-1-3-billion-generated-by-surface/",
              "title": "Microsoft sees $25.7 billion in Q2 2016 revenue, $1.3 billion generated by Surface"
              },
              {
              "origin": {
              "url": "http://feeds.nytimes.com/nyt/rss/Technology",
              "name": "nytimes"
              },
              "timestamp": 1454023275,
              "top_image": {
              "original": "http://static01.nyt.com/images/2016/01/29/technology/29microsoft-web/29microsoft-web-facebookJumbo.jpg"
              },
              "link": "http://www.nytimes.com/2016/01/29/technology/microsoft-earnings.html?partner=rss&emc=rss",
              "title": "Microsoft Profit and Revenue Fall, but Cloud Computing Grows"
              },
              {
              "origin": {
              "url": "http://www.ibtimes.com/rss/technology",
              "name": "ibtimes"
              },
              "timestamp": 1453985456,
              "top_image": {
              "original": "http://s1.ibtimes.com/sites/www.ibtimes.com/files/2016/01/27/gettyimages-499611466.jpg"
              },
              "link": "http://www.ibtimes.com/microsoft-corporation-msft-q2-2016-earnings-preview-can-windows-surface-office-365-2283017",
              "title": "Microsoft Corporation (MSFT) Q2 2016 Earnings Preview"
              },
              {
              "origin": {
              "url": "http://feeds.bbci.co.uk/news/technology/rss.xml",
              "name": "bbc"
              },
              "timestamp": 1454051784,
              "top_image": {
              "original": "http://ichef-1.bbci.co.uk/news/1024/cpsprodpb/119D4/production/_87984127_gettyimages-459885938.jpg"
              },
              "link": "http://www.bbc.co.uk/news/business-35433162#sa-ns_mchannel=rss&ns_source=PublicRSS20-sa",
              "title": "Microsoft shares boosted by growth in cloud services"
              }
              ],
 "images": [
            "http://www.gannett-cdn.com/-mm-/ae30453a4259521722cda7188e2bf84af9a33856/c=59-0-965-681&r=x408&c=540x405/local/-/media/2016/01/26/USATODAY/USATODAY/635894327817385896-ljlkj.JPG",
            "https://recodetech.files.wordpress.com/2015/12/20151216-microsoft-sign.jpg?quality=80&strip=info&w=1280",
            "https://tctechcrunch2011.files.wordpress.com/2016/01/2016-01-28_1326.png?w=1188&h=718"
            ],
 "texts": [
           "On the whole, it wasn't a great holiday quarter for Microsoft. Its revenues fell around 10 percent from last year (from $26.5 billion to $23.8 billion), while its net income fell around 15 percent (from $5.8 billion to $5 billion). Still, the company saw strong cloud growth, with Azure revenue up by 140 percent. Its overall Intelligent Cloud division revenue was up five percent. There were some pretty big gains in other categories, as well. Office 365 revenue jumped 70 percent compared to last year, for example, and it also reached 20.6 million customers. On the gaming front, Microsoft says it now has 48 million monthly active users (people who sign on at least once a month), an increase of 30 percent. Developing...",
           "Microsoft CEO Satya Nadella, shown here at the recent Davos World Economic Forum, is in the midst of leading the storied tech company through a major turnaround. (Photo: Jean-Christophe Bott, EPA) SAN FRANCISCO  It may take the rest of 2016 to yield the fruits of CEO Satya Nadella's turnaround labor, but some results should be apparent in its upcoming earnings report. The Redmond, Wash-based tech giant will report its fiscal second-quarter results after the bell on Thursday, anticipated to be 71 cents earnings per share on $25.2 billion in revenue, according to analyst consensus reports from S&P Capital IQ. Bernstein analyst Mark Moerdler is forecasting Street-beating EPS of 75 cents, anchored to continued momentum from Microsoft's Azure cloud services and a gradual turnaround in Windows and Office 365 revenue. Roadblocks would include lower than expected guidance for the next quarter. \"This is an important risk to consider given that estimates for Microsoft's Q3 results have come up and the company has a tendency to guide very conservatively (and) as with any quarter for Microsoft, there are always unknown unknowns,\" Bernstein wrote in his analyst note. Under Nadella, Microsoft has been feverishly reinventing itself from an isolated licensing fee-anchored enterprise to a more nimble and technologically adventurous company. Nadella spent much of 2015 shedding bad investments such as handset manufacturer Nokia, forging partnerships with would- be rivals such as Salesforce and challenging employees to help the company innovate. More evidence of this expansive mindset came with recent news that the company would be purchasing its leased Silicon Valley properties, with plans for a 50% growth in Bay Area employees. Microsoft's stock has risen nearly 25% year over year, outpacing the Nasdaq Composite Index's 6.9% 2015 gain. In Thursday trading, the stock was up 1% to $51.73. This upward stock trajectory would seem to justify the more than $100 million in cash and stock Nadella has made since taking the reins in February of 2014. Daniel Ives of FBR Capital Markets says he's expecting \"a slight beat, but no fireworks\" for the most recent quarter. He calls the cloud the epicenter of Microsoft (MSFT) growth for 2016 and beyond. \"Over the next 12 months, I'd like to see cloud hit a $9 or $10 billion annual run rate from the current $8 billion,\" Ives says. \"Windows 10 has been a big success (on 100 million devices since its release last summer), but now it's about a conversion to revenue this (calendar) year.\" Microsoft's Azure cloud is second only to Amazon's AWS (Amazon Web Services) in the burgeoning space, a $16 billion annual computer-storage rental proposition. AWS has an estimated 30% of market share to Microsoft's 10%, although Microsoft's year over year growth rate of 96% tops AWS's 51%, according to Synergy Research Group. IBM, Google and Salesforce round out the top five. Microsoft CEO Satya Nadella has helped keep his company in the spotlight through frequent public appearances, including his recent attendance at President Obama's final State of the Union speech. (Photo: Jack Gruber, USA TODAY) \"Azure is a compelling option that is slowly closing the gap on AWS, and I don't see anything taking away from that trend,\" says Gartner Research vice president Adam Woodyer. \"Microsoft is still tied to (shrinking) PC demand, but we do see a gradual decoupling on that front.\" Instead, the push is to grow users on the consumer and enterprise side by providing access points to its services via both mobile and desktop, says Forrester industry analyst Frank Gillett. \"It's going to be about having an account relationship (with Microsoft), so that the company can then engage those customers and make money on services, like extra storage on (Office 365's file sharing platform) OneNote,\" he says. \"The goal is to be with customers wherever they are. Microsoft is mid-course and so far it's looking like a good trajectory. They've gotten themselves out of the question-mark zone.\" Headwinds for Microsoft continue to be the shift away from PCs (75 million PCs shipped out globally in the fourth quarter of 2016, an 8% year-on-year decline, according to Gartner) as well as the ill-effects of a strong dollar (more than half of Microsoft's revenue comes from outside the U.S.). Looming opportunities for the company include its aggressive forays into new technologies such as virtual and augmented reality, says Scott Kessler of S&P Capital IQ. \"Lots of large cap tech companies such as Apple, Alphabet and Amazon, companies with more cash than they know what to do with, are look at the megatrends to see if there are opportunities not to be missed, with VR being one of them,\" says Kessler, noting that Microsoft's well-received HoloLens device should hit consumers this year. \"I don't expect those sorts of things to move the needle financially. But as much as companies are looking for market share, they're also looking for mind share. For the latter, it's important for Microsoft to be seen as a technology leader and innovator.\" Follow USA TODAY tech reporter Marco della Cava on Twitter @marcodellacava. Read or Share this story: http://usat.ly/1RNtI86",
           "Microsoft CEO Satya Nadella, shown here at the company's shareholder meeting in December 2015. (Photo: Stephen Brashear, Getty Images) SAN FRANCISCO - Anchored to continued cloud and other enterprise-focused growth, Microsoft beat Wall Street expectations Thursday with its second quarter earnings report. The Redmond, Wash-based software giant reported adjusted earnings per share of 78 cents against revenue of $25.7 billion, which surpassed S&P Capital IQ analyst consensus estimates of 71 cents earnings per share on $25.2 billion in revenue. The company's stock (MSFT) closed up 1.5% at $52.06, but jumped 5% in after-hours trading to $54.70. Highlights of the quarter include a jump in Microsoft's commercial cloud annualized revenue run rate to $9.4 billion, from $8.2 billion last quarter, and a leap to 200 million devices using Windows 10, up from 110 million last quarter. The company is aiming for a commercial cloud annualized run rate of $20 billion by fiscal year 2018. Microsoft's Azure service is second only to Amazon Web Services in the fight for a $16 billion annual market (Microsoft has 10% share to AWS's 30%). \"Nadella has put Microsoft into a position of strength into 2016 and beyond as cloud, Office 365, and Windows 10 puts fuel in Redmond's growth engine despite a choppy backdrop,\" says Daniel Ives of FBR Capital Markets. \"We believe Microsoft is seeing a generally healthy demand on cloud and core enterprise build-outs and is slowly moving away from the PC environment which clearly has massive headwinds.\" This is Microsoft's sixth straight quarter of EPS beats. The news reaffirms that CEO Satya Nadella, now two years at the helm of a radical company turnaround, has picked the right goals for the onetime software-selling king. Nadella has vowed to reshape Microsoft into a cloud- and mobile-first company aimed at being a leading player in enterprise work solutions, an effort to cast aside a losing model in a mobile age that continues to see declining global PC sales. Follow USA TODAY tech reporter Marco della Cava on Twitter @marcodellacava. Read or Share this story: http://usat.ly/1SMCeEv",
           "Microsoft posted its second-quarter 2016 earnings report Thursday, and shareholders had reason to be pleased. Overall revenue beat analysts' forecasts, and Surfacesales in particularsaw a sharp rise, pushed by the Surface Book and Surface Pro 4. Office 365 nearly doubled its revenue and increasedits consumer subscriber count, while Azure cloud sales were up140 percent. Microsoft posted earnings per share of $0.78, beating analyst expectations of $0.71. The company alsoposted $25.69billion in revenue,surpassing analysts' revenue estimateof $25.26 billion. Net income was $6.3billion. In the same quarter last year, Microsoft posted earnings per share of $0.71, revenue of $26.5 billion and net income of $5.86 billion. The company stock was at $55.50 in early after-hours trading, up 6.62 percent from market close at $52.06. Businesses everywhere are using the Microsoft Cloud as their digital platform to drive their ambitious transformation agendas, said Satya Nadella, chief executive officer at Microsoft, in a statement. Businesses are also piloting Windows 10, which will drive deployments beyond 200 million active devices. Productivity and Business Processes, which includes Office 365, declined 2 percent in revenue, in line with guidance. The operating unit made $6.7 billion in revenue, with Microsoft's prior guidance estimating around $6.6 billion to 6.7 billion. Office 365 revenue grew nearly 70 percent,a sign of Microsoft's success at diversifying away from Windows. \"They used to depend on trapping you in the ecosystem with their operating system, and they've transcended that,\" said Kim Forrest, VP and senior equity analyst at Fort Pitt Capital Group. Intelligent Cloud, which includes the Azure cloud computing platform, grew 5 percentto $6.3billion. In its prior guidance, Microsoft estimated around $6.2 billion to 6.3 billion revenue. Azure revenue alone grew a whopping 140 percent. Sales in Microsoft's personal computing groupdeclined 5 percentto $12.7billion, beatingprior guidance that estimatedaround $12 billion to $12.4 billion in revenue. The unit includes Windows 10, Bing and the Surface line of tablets.Surface revenue grew by 29 percent year over year. \"I've always seen Surface as the showcase of what [Windows 10] hardware can do,\" said Forrest.",
           "Microsoft on Thursday posted fiscal second-quarter results ahead of analysts estimates amid strong results from its cloud business. The company posted $5 billion in net income, or 62 cents per share, on revenue of $23.8 billion. Excluding certain items, the company reported income of $6.3 billion, or 78 cents per share, on adjusted revenue of $25.7 billion. Analysts were expecting per-share earnings of 71 cents on revenue of $25.2 billion. Microsoft, while often seen as not possessing the cool factor of Google and Apple, has nonetheless continued to top expectations in recent quarters amid strong sales to businesses. The company said it will provide financial outlook when it holds a conference call with analysts later on Thursday. It was a strong holiday season for Microsoft, highlighted by Surface and Xbox, Chief Operating Officer Kevin Turner said in a statement. Our commercial business executed well as our sales teams and partners helped customers realize the value of Microsofts cloud technologies across Azure, Office 365 and CRM Online. CEO Satya Nadella said business testing of Windows 10 should help the operating system to be running soon on 200 million devices. The company has set a goal of having a billion devices running the software in a couple years time. Shares rose in after-hours trading, changing hands recently at $55.46, up $3.40 or more than 6 percent. Among other highlights, Microsoft noted that: * Windows revenue from computer makers dropped 5 percent, though that was less than overall PC market decline * Nearly 30 percent of search revenue in December was driven by Windows 10 * Microsofts devices business saw mixed results as Surface revenue increased 29 percent in constant currency, while phone revenue fell by nearly half.",
           "Microsoft today reported earnings for its second financial quarter of 2016 (I know, thats weird, but Microsofts financial year ends in June). The company reported non-GAAP revenue of $25.7 billion for the last quarter and $0.78 of adjusted per-share profit. In the year-ago quarter, the company reported revenue of $26.5 billion and earnings of $0.71. Wall Street expected Microsoft to deliver an EPS of $0.71 on revenue of $25.26 billion. Businesses everywhere are using the Microsoft Cloud as their digital platform to drive their ambitious transformation agendas, said Satya Nadella, chief executive officer at Microsoft. Businesses are also piloting Windows 10, which will drive deployments beyond 200 million active devices. Last quarter, Microsoft broke out results for its different business units for the first time and thankfully, the company didnt make any changes to this process this time around. Here is what its results look like when we break them down by business unit. Productivity and Business Processes (PBP), including Office, consumer Office, and Dynamics: $6.7 billion compared to $6.3 billion in revenue last quarter. Office 365 now has 20.6 million subscribers. Intelligent Cloud (IC), which includes service revenue and Enterprise Services: $6.4 billion compared to $5.9 billion in the last quarter. More Personal Computing (MPC), which contains Windows, Devices, Gaming and Search: $12.7 billion. Last quarter, the company reported $9.4 billion in revenue for this group. This was largely driven by increased sales of Microsofts surface line, though phone revenue expectedly declined by 49 percent. Last quarter, Microsoft also announced that its commercial cloud business was on an $8.2 billion annual run rate, up from $8.2 billion in its last financial quarter of 2015. This quarter, the company updated this number to $9.4 billion. Microsoft has previously said that it expects this number to hit $20 billion by 2018.",
           "Microsoft today reported earnings for its second fiscal quarter of 2016, including revenue of $25.69 billion and earnings per share of $0.78. Analysts had expected the company to earn $25.26 billion in revenue and earnings per share of $0.71. Microsofts stock was up 1.63 percent in regular trading. In after-hours, however, the company is up another 5 percent. Last quarter, Microsoft started reported earnings by breaking down its results into three operating groups, plus a Corporate and Other section. Well look at each more closely to see how the company fared. Productivity and Business Processes This segment, which includes results from Office and Office 365 (commercial and consumer customers), declined 2 percent to $6.7 billion. Office 365 had a decent quarter, adding 2.4 million subscribers to hit 20.6 million. Office commercial products and cloud services revenue grew 5 percent with Office 365 revenue growth of nearly 70 percent. At this point, steady Office 365 growth is not much of a surprise. The company is slowly but surely converting its traditionally most lucrative software business into a subscription revenue stream. Intelligent Cloud This segment, which includes results from server products and services (including Windows Server and Azure), grew 5 percent to $6.3 billion. Server products and cloud services revenue grew 10 percent. But the big highlight was Azure revenue, which grew 140 percent, including revenue from Azure premium services growing nearly 3x year-over-year. More Personal Computing This segment, which includes results Windows licensing and devices (Surface, phones, and Xbox), declined 17 percent to $9.4 billion. Microsoft saw Surface revenue jump from $1.10 billion in Q2 2015 to $1.35 billion in Q2 2016. The Surface Pro 4 and the Surface Book seem to be selling well. And yet, we still dont know how many Microsoft is pushing out, as the number includes accessories and older Surface devices. More to follow",
           "Photo Advertisement Continue reading the main story SEATTLE  Satya Nadella has put cloud computing at the center of Microsofts strategy. It is a move that looks to be paying off, at least in the eyes of investors. On Thursday the company said its revenue and profit fell in the last quarter. But it mattered little, as Microsoft made more from cloud computing, and its stock jumped more than 5 percent immediately after the numbers were released. The results underscored the good and bad trends that have come to characterize Microsofts financial results in recent years. On the negative side, there is the floundering personal computer business, which is hurting profits from longtime Microsoft software businesses, especially Windows. On the positive, the companys cloud business keeps growing, giving investors hope that Microsoft will remain relevant for years to come. The success of Microsofts cloud business under Mr. Nadella, its new chief executive, has put the companys stock back in favor with investors. Even with recent anxiety in the stock market, Microsofts shares are up more than 28 percent for the last year, while shares in rivals like Apple, Oracle and IBM have declined by double digits. By most analysts estimates, Microsoft is in second place in the most prominent segment of the cloud services market  in which computer storage and other services in data centers are rented to customers  after Amazon. IBM and Google are next. For its second fiscal quarter, which ended on Dec. 31, the company reported net income of nearly $5 billion, or 62 cents a share, compared with $5.86 billion, or 71 cents a share, during the same period a year earlier. Revenue fell to $23.8 billion, down from $26.47 billion a year ago. The figures in the recent quarter reflected a huge deferral of revenue, almost $1.9 billion, related to Windows 10, the companys latest operating system. Although it collects all the cash up front from selling the software to PC makers and others, accounting rules dictate that the company has to spread its recognition of the money over the life of the product. Without that deferral, Microsoft had $25.69 billion in revenue and 78 cents a share in earnings, better than the average forecast of analysts surveyed by Thomson Reuters of 71 cents a share in earnings and $25.26 billion in revenue. Even without the Windows deferral, Microsofts numbers declined from the previous year, in large part because the company in July sharply scaled back the ambitions of its money-losing smartphone business, acquired from Nokia. The companys phone revenue plummeted 49 percent when excluding foreign currency fluctuations as a result of the changes, which included cutting the number of smartphones it sells. Microsofts cloud business encouraged investors. The companys intelligent cloud group, which includes its Azure service, rose 5 percent to $6.3 billion. It now has 20.6 million consumer subscribers to Office 365, the cloud version of its productivity applications, up from 9.2 million a year earlier. Advertisement Continue reading the main story Advertisement Continue reading the main story Last July, Microsoft introduced Windows 10, raising some hope in the industry of a rebound in PC sales. That rebound has not materialized yet. Global shipments of new PCs declined 8.3 percent during the fourth quarter compared with a year earlier, the research firm Gartner recently reported. The revenue Microsoft gets from PC makers for Windows declined 5 percent in the quarter, excluding foreign currency impacts. Revenue from its own Surface line of computers and tablets rose to $1.35 billion from $1.1 billion a year earlier. The company no longer charges most customers to upgrade existing computers to Windows 10, hoping to get as many people as possible running the latest operating system and wooing developers back to Windows. The company has lost considerable influence among developers, who have gravitated to Apples iOS and Googles Android operating systems. In a phone interview, Amy Hood, Microsofts chief financial officer, said Microsoft was not yet predicting a turnaround in the PC market. Our expectation for the PC market is roughly in line with most analysts, Ms. Hood said. For the next year, we understand the market is not likely to grow, but we can still grow.",
           "Microsoft is set to report its fiscal second quarter 2016 earnings after the bell on Thursday, and Surface, Azure and Office 365 will be key areas investors will lookat tomeasure the company's progress toward reaching CEO Satya Nadella's goal of becoming a \"mobile first, cloud first\" company that is less dependent on Windows for revenue growth. Unlike recent years, analysts aregenerally bullish about thesoftware maker'sprospects. 20market watcherscurrently rate MSFT stock as a \"buy.\" The average stock price target for Microsoft is $58.35, a 12.2 percent increase over the Wednesday opening price of $52.01. Analysts are predicting earnings per share of $0.71 with the average revenue estimateat $25.26 billion. In October 2015, Microsoft issued guidance that predicted total revenue of $24.8 to $25.4 billion. Microsoft has been making big moves in its key strength areas, and there's reason to believe it could report a solid quarter. The Surface line of tablets received major updates in late October, with the launch of the Surface Pro 4 and Surface Book, the latter being Microsoft's first ever laptop. In the second quarter 2015 results, Surface revenue hit $1.1 billion, up 24 percent year-over-year. Surface growth is important, but Microsoft won't be bettingfutureearnings on tabletsjust yet. \"I don't think that they think it's going to be a growth spot in the same way the iPhone drives earnings for Apple,\" said Frank Gillett, analyst at Forrester. The tablet lineis more a showcase that showsthe public what device makers can do with Windows 10. \"It's more like the Mac. It's symbolically important, but not vital to the overall success of the company,\" Gillett said. Windows is still in atransitional period, as the company is giving away its latest release for free to consumers running Windows 7 or 8.1. That doesn't mean investors will be ignoring the company's reported figures, however. But there's still plenty of revenue sources from Windows. Device makers will be buying Windows 10 to install on new computers, enterprise customers will be buying copies and someconsumers simply aren't eligible for the upgrade offer. \"Microsoft's going to be making money off Windows for a long time,\" said David Mitchell Smith, analyst at Gartner. Enterprise could be key to adoption. In December 2015, Windows 10 accounted for 9.96 percent of global desktop operating system usage, taking fourth place behind 8.1, XP and 7, the latter claiming 55.68 percent. Gillett said thatbusinesses are still using Windows 7, having skipped 8, but that may soon change. Half of enterprises will start deploying Windows 10 by the start of 2017, according to a November 2015 report from Gartner. Windows may be what the company is best known for, but Azure and Office 365 are crucial strong points. In the second quarter of 2015, commercial cloud revenue (which includes the two services) grew 114 percent, reaching an annualized revenue run rate of $5.5 billion. The strength of the cloud services are a good sign for Microsoft that the company is able to succeed with services that don't depend on Windows. Azure made headlines with the first technical preview of an Azure Stack based on Ubuntu Linux. On the Office 365 side, Microsoft updated its Office iOS apps to fully support the iPad Pro, showing the company isn't totally betting on Windows phones to find success in the mobile arena. In the latter case, Gillett said that Microsoft could be playing a long game by offering its services on other platforms. The company can hook consumers onto its Office iOS offerings, for example, then tempt them with the prospect of a better integrated experience with a Windows phone.",
           "Image copyright Getty Images Image caption Microsoft chief executive Satya Nadella has been focusing on cloud computing services Microsoft shares rose in after-hours trading as it reported strong growth in its cloud computing and mobile applications divisions. Chief executive Satya Nadella has been focusing on cloud services and revenue for the division rose 5% to $6.3bn. However, profits for the three months to 31 December fell 15% to $5bn (3.4bn) as the strong dollar and falling PC sales took their toll. Total revenue also slipped 10.1% to $23.8bn. Both numbers were better than analysts had expected. NPD Group analyst Stephen Baker said: \"People who think Microsoft is sliding into irrelevancy really need to re-evaluate how they see the company. They are a software-first company in a world that is increasingly about software.\" Matt Howard, a venture capitalist at Norwest Ventures, said Microsoft had \"nailed the cloud\". Mr Nadella said: \"The enterprise cloud opportunity is massive - larger than any market we have ever participated in.\" Microsoft's combined cloud business, which also includes other divisions such as Office 365, was on track for $9.4bn in annual revenue - higher than its previous forecast of $8.2bn. The global cloud storage industry was worth almost $19bn last year, according to Research and Markets. The group estimates that will rise to $65bn by 2020. Microsoft's decision to focus more on cloud services - where its competitors include Amazon, Google, IBM and Cisco - has helped it move away from the declining PC market. Microsoft's revenue from personal computing, which includes the Windows business, fell 5% in the quarter to $12.7bn. Image copyright Getty Images Surface success Global PC shipments fell 10.6% in the fourth quarter compared with the same period in 2014, according to IDC. The research firm said PC sales should improve later this year as companies that had delayed replacing computers ahead of the release of Windows 10 last summer start buying again. Tablet computers were a bright spot for Microsoft, with revenue up 29% following the launch of the Surface Pro 4 and Surface Book. The number of people using the Xbox Live service for digital content and video games climbed 30% to a record 48 million. Shares in Microsoft were up 4.2% to $54.25 in after-hours trading in New York and have risen 10% in the past 12 months."
           ],
 "common_words": [
                  "microsoft",
                  "cloud",
                  "revenue"
                  ],
 "top_image": {
 "low": "http://i68.servimg.com/u/f68/13/85/87/18/gettyi10.jpg",
 "original": "http://s1.ibtimes.com/sites/www.ibtimes.com/files/2016/01/28/gettyimages-491566280.jpg"
 },
 "summary": [
             "The Redmond, Wash-based tech giant will report its fiscal second-quarter results after the bell on Thursday, anticipated to be 71 cents earnings per share on $25.2 billion in revenue, according to analyst consensus reports from S&P Capital IQ.",
             "CEO Satya Nadella said business testing of Windows 10 should help the operating system to be running soon on 200 million devices.",
             "Businesses everywhere are using the Microsoft Cloud as their digital platform to drive their ambitious transformation agendas, said Satya Nadella, chief executive officer at Microsoft.",
             "Intelligent Cloud (IC), which includes service revenue and Enterprise Services: $6.4 billion compared to $5.9 billion in the last quarter.",
             "Microsoft today reported earnings for its second fiscal quarter of 2016, including revenue of $25.69 billion and earnings per share of $0.78.",
             "Productivity and Business Processes This segment, which includes results from Office and Office 365 (commercial and consumer customers), declined 2 percent to $6.7 billion.",
             "The strength of the cloud services are a good sign for Microsoft that the company is able to succeed with services that don't depend on Windows.",
             "Tablet computers were a bright spot for Microsoft, with revenue up 29% following the launch of the Surface Pro 4 and Surface Book."
             ],
 "tweets": [
            {
            "id": 692830082872713216,
            "text": "Sorry, Windows Phone. 110m lifetime sales - 4.5bn iOS & Android phones sold in the same period",
            "name": "Benedict Evans",
            "username": "@BenedictEvans",
            "blockquote": "",
            "link": "https://twitter.com/BenedictEvans/status/692830082872713216"
            },
            {
            "id": 692965162995838976,
            "text": "#Sitecore's Alliance partner, #Microsoft, beats the Street on #Cloud growth http://usat.ly/1SMCeEv ",
            "name": "Jean Paul Gomes",
            "username": "@jeanpaulgomes",
            "blockquote": "",
            "link": "https://twitter.com/jeanpaulgomes/status/692965162995838976"
            }
            ],
 "quotes": [
            {
            "person": "Satya Nadella",
            "text": "Businesses everywhere are using the Microsoft Cloud as their digital platform to drive their ambitious transformation agendas"
            }
            ],
 "products": [
              {
              "name": "Windows 10",
              "source_name": "wikipedia",
              "source_url": "https://en.wikipedia.org/wiki/Windows_10",
              "text": "Windows 10 is a personal computer operating system released by Microsoft as part of the Windows NT family of operating systems. It was officially unveiled in September 2014 following a brief demo at Build 2014."
              }
              ],
 "companies": [
               {
               "name": "Microsoft",
               "source_name": "wikipedia",
               "source_url": "https://en.wikipedia.org/wiki/Microsoft",
               "text": "Microsoft Corporation is an American multinational technology company headquartered in Redmond, Washington, that develops, manufactures, licenses, supports and sells computer software, consumer electronics and personal computers and services."
               }
               ],
 "people": [
            {
            "name": "Satya Nadella",
            "source_name": "wikipedia",
            "source_url": "https://en.wikipedia.org/wiki/Satya_Nadella",
            "text": "Satya Narayana Nadella is an India-born American business executive. He is the current chief executive officer (CEO) of Microsoft.[",
            "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6c/Satya_Nadella.jpg/500px-Satya_Nadella.jpg",
            "twitter": "http://twitter.com/satyanadella"
            }
            ],
 "organizations": [],
 "locations": [
               "Redmond, Washington"
               ]
 },
 {
 "_id": "1454105271",
 "_rev": "3-31e10db936bc4612ee6b2ac414585bc2",
 "articles": [
              {
              "origin": {
              "url": "http://thenextweb.com/feed/",
              "name": "thenextweb"
              },
              "timestamp": 1454106818,
              "top_image": {
              "original": "http://cdn1.tnwcdn.com/wp-content/blogs.dir/1/files/2013/05/gun.jpg"
              },
              "link": "http://thenextweb.com/facebook/2016/01/30/report-facebook-to-ban-private-gun-sales/",
              "title": "Facebook to ban private gun sales"
              },
              {
              "origin": {
              "url": "http://feeds.nytimes.com/nyt/rss/Technology",
              "name": "nytimes"
              },
              "timestamp": 1454105271,
              "top_image": {
              "original": "http://static01.nyt.com/images/icons/t_logo_291_black.png"
              },
              "link": "http://www.nytimes.com/2016/01/30/technology/facebook-gun-sales-ban.html?partner=rss&emc=rss",
              "title": "Facebook Moves to Ban Private Gun Sales on Its Site"
              },
              {
              "origin": {
              "url": "http://feeds.slashgear.com/slashgear",
              "name": "slashgear"
              },
              "timestamp": 1454114726,
              "top_image": {
              "original": "http://www.slashgear.com/wp-content/uploads/2016/01/Facebook-822x420.jpg"
              },
              "link": "http://feeds.slashgear.com/~r/slashgear/~3/yUScim9yw54/",
              "title": "Facebook cracks down on private gun sales"
              },
              {
              "origin": {
              "url": "http://rssfeeds.usatoday.com/usatoday-TechTopStories",
              "name": "usatoday"
              },
              "timestamp": 1454133918,
              "top_image": {
              "original": "http://www.gannett-cdn.com/-mm-/219be59df7143130da6695a5d30cbbd05dbd8c3f/c=0-333-3456-2286&r=x1683&c=3200x1680/local/-/media/2016/01/30/USATODAY/USATODAY/635897160768228163-AFP-548316841-79207312.JPG"
              },
              "link": "http://rssfeeds.usatoday.com/~/135323393/0/usatoday-techtopstories~Facebook-bans-private-gun-sales/",
              "title": "Facebook bans private gun sales"
              },
              {
              "origin": {
              "url": "http://www.cnet.com/rss/news",
              "name": "cnet"
              },
              "timestamp": 1454112999,
              "top_image": {
              "original": "http://cnet2.cbsistatic.com/hub/i/r/2016/01/13/a81e6cd0-06a5-426f-ac2e-994982ee36f5/thumbnail/670x503/d718be665ecd81274dd6ec9cf0c9cb17/jonathan-pointing-server-room-reduced-1.jpg"
              },
              "link": "http://cnet.com.feedsportal.com/c/34938/f/645093/s/4d3c0296/sc/24/l/0L0Scnet0N0Cnews0Cfacebook0Etakes0Ea0Eshot0Eat0Egun0Esellers0C0Tftag0FCAD590Aa51e/story01.htm",
              "title": "Facebook takes a shot at gun sellers"
              },
              {
              "origin": {
              "url": "http://time.com/tech/feed/",
              "name": "time"
              },
              "timestamp": 1454108496,
              "top_image": {
              "original": "https://timedotcom.files.wordpress.com/2016/01/facebook-logo-003.jpg"
              },
              "link": "http://time.com/4200996/facebook-bans-gun-sales/",
              "title": "Facebook Says It Will Ban Gun Sales Between Users"
              },
              {
              "origin": {
              "url": "http://www.huffingtonpost.com/feeds/verticals/technology/index.xml",
              "name": "huffingtonpost"
              },
              "timestamp": 1454107785,
              "top_image": {
              "original": "http://img.huffingtonpost.com/asset/1200_630/56abefbe1f00007f00216fb8.jpeg"
              },
              "link": "http://feeds.huffingtonpost.com/c/35496/f/677097/s/4d3bdd18/sc/7/l/0L0Shuffingtonpost0N0C20A160C0A10C290Cfacebook0Eprivate0Egun0Esales0In0I911670A20Bhtml0Dutm0Ihp0Iref0Ftechnology0Gir0FTechnology/story01.htm",
              "title": "Facebook To Block Private Gun Sales"
              },
              {
              "origin": {
              "url": "http://feeds.venturebeat.com/VentureBeat",
              "name": "venturebeat"
              },
              "timestamp": 1454106959,
              "top_image": {
              "original": "http://1u88jj3r4db2x4txp44yqfj1.wpengine.netdna-cdn.com/wp-content/uploads/2015/07/16743258899_0cc2a49bcd_k-780x520.jpg"
              },
              "link": "http://venturebeat.com/2016/01/29/facebook-bans-person-to-person-gun-sales-on-its-site/",
              "title": "Facebook bans person-to-person gun sales on its site"
              }
              ],
 "common_words": [
                  "person",
                  "facebook",
                  "gun",
                  "sale"
                  ],
 "summary": [
             "But according to the New York Times, the company has finally taken steps to ban private person-to-person gun sales on both Facebook and Instagram.",
             "\"Over the last two years, more and more people have been using Facebook to discover products and to buy and sell things to one another,\" Monika Bickert, Facebook's head of product policy, said in a statement.",
             "Advertisement Continue reading the main story Facebook is banning private sales of guns on its flagship social network and on its Instagram photo-sharing service, the company said late Friday.",
             "We are continuing to develop, test and launch new products to make this experience even better for people and are updating our regulated goods policies to reflect this evolution.",
             "President Obama and state attorneys general have increased pressure on Facebook to tighten restrictions on firearms because of the proliferation of posts that offer guns for sale, often without background checks.",
             "One of our reporters were able to purchase a semiautomatic rifle and ammunition in less than 15 minutes on the social network.",
             "The ban, actually an update to a policy that already prohibits the sale of marijuana, pharmaceuticals, and illegal drugs, does not apply to for-sale posts by licensed gun dealers."
             ],
 "texts": [
           "One of the biggest critiques of Facebooks role as a platform is its allowance of personal gun sales between two people online. But according to the New York Times, the company has finally taken steps to ban private person-to-person gun sales on both Facebook and Instagram. This is another, more deliberate step in Facebooks journey to curb its presence as one of the biggest websites for gun sales, following a 2014 decision tolimit their presence in news feeds, particularly to minors. The company has often been caught in the middle of gun control activists who believe the site is abetting potentially illegal sales of personal firearms and the pushback from gun enthusiasts who bristle at forms of censorship and regulation. But Facebook is shedding its image as an informal marketplace to actually become its own ecommerce platform. The company has been testing the ability to buy productson the site, and now invites users to store credit card information within the platform for easy purchase and personal transactions. Facebook isnt alone in this aspect when it comes to banning guns. Both Craigslist and Amazon have banned the sale of guns from their platforms, and EBay has a very strict policywhen dealing in the sale and transport of weapons and ammunition. For example, whole firearms cannot be sold on eBay, butparts of them can. As Facebook continues to delve into ecommerce, it is no surprise that it will take the steps its forerunners have already made. In turn, it will possibly kill one of the biggest ways people privately sell guns online.  Facebook Moves to Ban Private Gun Sales on Its Site [New York Times]",
           "Advertisement Continue reading the main story Facebook is banning private sales of guns on its flagship social network and on its Instagram photo-sharing service, the company said late Friday. President Obama, state attorneys general and gun safety groups had increased pressure on the company to stop the flow of Facebook posts and Instagram messages offering guns for sale, often without background checks. Although Facebook has never been directly involved in gun sales, it has served as a forum for gun sales to be negotiated. The ban applies to private, person-to-person sales of guns, though not to posts by licensed gun dealers. Facebook already prohibits people from offering marijuana, pharmaceuticals and illegal drugs for sale, and is updating its policy to include guns. Over the last two years, more and more people have been using Facebook to discover products and to buy and sell things to one another, said Monika Bickert, Facebooks head of product policy, in a statement. We are continuing to develop, test and launch new products to make this experience even better for people and are updating our regulated goods policies to reflect this evolution. Facebook also took steps in 2014 to limit gun sales on its site and on Instagram, including by shielding minors from Facebook pages that advertised guns for sale. At the time, the social network was one of the worlds largest marketplaces for guns. Facebook has 1.59 billion monthly visitors.",
           "Facebook cracks down on private gun sales Peer to peer sales that are coordinated  and maybe even paid for through  Facebook are nothing new. The social network makes it easy to get in contact with someone, share pictures, and thanks to that money sending feature added to Messenger not too long ago, even pay for an item. Among the things being sold privately through Facebook were firearms, something the social network has now explicitly banned. Facebook banned the private sale of firearms in a policy update today; this includes coordinating the sale of ammo through the social network, as well. In the past, private gun sales on Facebook had some restrictions based on age, reminders to follow the laws, and other things also presented when items like alcohol are sold. Anyone who posts a private firearm or ammo for sale on Facebook could have the post removed, assuming it is either detected by the social networks system or reported by someone. This is the first product to be banned from peer to peer sales; Facebook also bars prescription drug sales and marijuana sales. Said Facebooks global product policy head Monika Bickert: Over the last two years, more and more people have been using Facebook to discover products and to buy and sell things to one another. We are continuing to develop, test and launch new products to make this experience even better for people and are updating our regulated goods policies to reflect this evolution. The same ban is now in place for Instagram, as well. VIA: The Washington Post",
           "Facebook has announced that it will ban users from coordinating private sales of firearms on the social network. Facebook CEO Mark Zuckerberg speaks at the F8 summit in San Francisco, California. Facebook in March 2015. (Photo: Josh Edelson, AFP/Getty Images) SAN FRANCISCO  Facebook is cracking down on private gun sales. The Menlo Park, Calif., company said late Friday it will ban users from coordinating private sales of firearms on the social network and on mobile app Instagram. The ban does not apply to licensed gun dealers for purchases completed off Facebook. President Obama and state attorneys general have increased pressure on Facebook to tighten restrictions on firearms because of the proliferation of posts that offer guns for sale, often without background checks. Facebook and Instagram users will no longer be able to offer or coordinate the private sale of firearms, gun parts and ammunition, the company said. That brings firearms in line with Facebook's ban on the private sales of marijuana, pharmaceuticals and illegal drugs. Users can't buy and sell guns on Facebook itself but gun enthusiasts often connect there and sometimes make arrangements to buy, sell and trade guns. In March 2014, Facebook took steps to limit sales of firearms including blocking minors from seeing posts about gun sales and trades and by requiring Facebook pages primarily used to promote the private sale of regulated goods and services to include language that reminds users to comply with laws and regulation. At the time, an investigation by the technology blog VentureBeat found that adults and children were connecting on Facebook pages devoted to guns to buy, sell and trade firearms, sometimes in violation of federal and state gun laws. Federal law enforcement sources told VentureBeat that Facebook, Instagram and other social media services were \"emerging threats for unlawful gun transactions in the United States.\" Moms Demand Action for Gun Sense in America and Mayors Against Illegal Guns, the group backed by former New York Mayor Michael Bloomberg, had stepped up their demands for changes to Facebook's policies after gun arrests were tied to sales of guns facilitated through Facebook. \"Over the last two years, more and more people have been using Facebook to discover products and to buy and sell things to one another. We are continuing to develop, test, and launch new products to make this experience even better for people and are updating our regulated goods policies to reflect this evolution,\" Monika Bickert, Facebook's head of product policy, said in an emailed statement. Follow USA TODAY senior technology writer Jessica Guynn@jguynn Read or Share this story: http://usat.ly/1SOZmCk",
           "Facebook is banning private gun sales on its main social network and Instagram too. The Menlo Park, California-based company said Friday that it plans to stop person-to-person firearms sales on its networks. The ban, actually an update to a policy that already prohibits the sale of marijuana, pharmaceuticals, and illegal drugs, does not apply to for-sale posts by licensed gun dealers. The move comes after President Barack Obama earlier this month announced renewed efforts to curb gun violence, including expanded background checks and research into smart guns, which use radio signals or fingerprint scanners to ensure a weapon can be fired only by its owner. Though the president spoke passionately about the issue, the gun and technology industries have been slow to respond. Only one company was showing off new smart-gun technology during CES, the largest tech expo in the country, and none were doing so at the largest gun show. Both shows were held within days of Obama's speech. \"Over the last two years, more and more people have been using Facebook to discover products and to buy and sell things to one another,\" Monika Bickert, Facebook's head of product policy, said in a statement. \"We are continuing to develop, test and launch new products to make this experience even better for people and are updating our regulated-goods policies to reflect this evolution.\" This isn't the first time Facebook, which owns the Instagram photo-sharing social network, has pushed back against guns on its network. In 2014, the service said it would police posts designed to circumvent gun sales laws. \"We will not permit people to post offers to sell regulated items that indicate a willingness to evade or help others evade the law,\" Bickert said in a statement at the time. The New York Times first reported the gun sale ban. Update, 4:30 p.m. PT: Adds confirmation and details of the news from Facebook.",
           "Social networking giant Facebook announced Friday that it would ban the private sale of guns on its site, and on its photo-sharing platform Instagram. Although the site itself does not act as a retailer of firearms, it has allowed users to sell guns on Facebook pages or in Instagram posts. The new prohibitions will affect only private and person-to-person sales, and not licensed gun sellers. Over the last two years, more and more people have been using Facebook to discover products and to buy and sell things to one another, said Monika Bickert, Facebooks head of product policy. We are continuing to develop, test and launch new products to make this experience even better for people and are updating our regulated goods policies to reflect this evolution. Those policies already prohibit trade in marijuana, prescription pills and other illicit substances. Firearms are now to be added to the list. A New York Times report cites increased pressure from the Obama administration and gun safety groups to stem the tide of posts soliciting guns as reason for Facebooks decision.",
           "Facebook, the world's most popular social network, is cracking down on private gun sales. Facebook will no longer allow private individuals to buy and sell weapons on its network, including its Instagram photo-sharing service, a spokeswoman said Friday. \"It's important because it will save American lives, because people will not be able to sell guns to dangerous people in unfettered fashion, and it sends an incredibly strong cultural signal,\" Shannon Watts, a representative for Moms Demand Action for Gun Sense in America, told HuffPost in an email. \"Congress has not stood up to protect its constituents, but Facebook is stepping up to protect its users.\" Licensed firearms dealers will still be able to use Facebook to facilitate transactions, but not private individuals. Firearms have been easily traded on the social platform for years. As VentureBeat explained in 2014, the process takes about 15 minutes: Anyone, even a teenager, could theoretically find their way to one of \"dozens\" of online Facebook groups and arrange a purchase. Many of the person-to-person transactions are legitimate -- allowed under loopholes in gun laws. But as VentureBeat noted, it's all too easy for sketchy deals: For instance, you can buy automatic weapons without a permit, guns with their serial numbers filed off, and weapons that may be prohibited by your states laws. If youre under 18, you can buy a handgun, which federal law prohibits. On Tuesday, a VentureBeat reporter and his colleague spent less than 15 minutes arranging to buy a semiautomatic 7 mm rifle and 90 rounds of ammunition from a guy named Dave, a member of Facebook Firearms Only Alamogordo fan page. The New York Times reported earlier this month that gun sales by unlicensed dealers continue to happen on Facebook. That's about to change. \"Over the last two years, more and more people have been using Facebook to discover products and to buy and sell things to one another,\" Monika Bickert, Facebooks head of product policy, told HuffPost in an email. \"We are continuing to develop, test, and launch new products to make this experience even better for people and are updating our regulated goods policies to reflect this evolution.\" Meanwhile, gun violence rages. There were 372 mass shootings in the U.S. last year, killing 475 and wounding many more, according to PBS NewsHour. Earlier this week, HuffPost reported that U.S. shootings since 1963 have \"killed more Americans than all wars ever.\" Also on HuffPost:",
           "Facebook says that its banning users from coordinating private sales of firearms on its social network. The move largely affect transactions that take place on the site, as the company will allow licensed retailers to advertise firearms on Facebook as long as the transactions take place outside of its platform. The ban applies to private, person-to-person sales of guns on Facebook and Instagram, but not to licensed gun dealers. Its a response to pressure coming from not only gun control advocates, but also President Obama and state attorneys general looking to restrict sales on one of the top sites on the Internet. The company says it has systems in place to review and remove content that violates our terms of service and advertising that is false, deceptive, or misleading. In a statement, Facebook head of product policy Monika Bickert said Over the last two years, more and more people have been using Facebook to discover products and to buy and sell things to one another. We are continuing to develop, test and launch new products to make this experience even better for people and are updating our regulated goods policies to reflect this evolution. This isnt the first time that Facebook has cracked down on firearms on the social networks. In 2014, it started to tighten policies on posts around illegal gun sales after being pressured by groups like the Mayors Against Illegal Guns and the Moms Demand Action. Its policy already prohibits people from offering marijuana, pharmaceuticals, and illegal drugs for sale. At the time, the company announced a series of educational and enforcement measures regarding guns and other regulated items on its platform. The policy update not only affected Facebooks core service, but also Instagram. As it stands, access to posts about gun sales and trade were limited to those 18 years or older, and it would require Facebook pages that are used to promote these sales to include language reminding administrators and sellers to comply with laws and regulations. In February 2014, VentureBeat conducted an investigation that uncovered dozens of pages on Facebook in 2014 where we learned that guns such as semi-automatic weapons, handguns, and silencers were posted for sale on the site. One of our reporters were able to purchase a semiautomatic rifle and ammunition in less than 15 minutes on the social network. More information: Facebook Facebook is the worlds largest social network, with over 1.39 billion monthly active users. Facebook was founded by Mark Zuckerberg in February 2004, initially as an exclusive network for Harvard students. It was a huge hit: in 2 we... read more  Powered by VBProfiles"
           ],
 "top_image": {
 "low":"http://static01.nyt.com/images/2016/01/30/business/30facebook-web1alt/30facebook-web1alt-master675.jpg",
 "original":"http://static01.nyt.com/images/2016/01/30/business/30facebook-web1alt/30facebook-web1alt-master675.jpg"
 },
 "tweets": [
            {
            "id": 48735758,
            "text": "Holy Smoke! New Raspberry Pi Zero Costs Just$5 ",
            "name": "Alice Bonasio",
            "username": "@alicebonasio",
            "blockquote": "<blockquote class=\"twitter-tweet\" lang=\"en\"><p lang=\"en\" dir=\"ltr\">Holy Smoke! New Raspberry Pi Zero Costs Just$5 <a href=\"https://t.co/Iwc0qS5KDW\">https://t.co/Iwc0qS5KDW</a> via <a href=\"https://twitter.com/TechCrunch\">@techcrunch</a></p>&mdash; Alice Bonasio (@alicebonasio) <a href=\"https://twitter.com/alicebonasio/status/674268807955922944\">December 8, 2015</a></blockquote>",
            "link":"https://twitter.com/markfollman/status/692219496229126146"
            }
            ],
 "quotes": [
            {
            "person": "John Doe",
            "text": "Facebook test quote"
            }
            ],
 "products": [],
 "companies": [
               {
               "name": "Facebook",
               "source_name": "wikipedia",
               "source_url": "https://en.wikipedia.org/wiki/Facebook",
               "text": "Facebook is an online social networking service headquartered in Menlo Park, California. Its website was launched on February 4, 2004, by Mark Zuckerberg with his Harvard College roommates and fellow students Eduardo Saverin, Andrew McCollum, Dustin Moskovitz and Chris Hughes."
               }
               ],
 "people": [
            {
            "name": "Mark Zuckerberg",
            "source_name": "wikipedia",
            "source_url": "https://en.wikipedia.org/wiki/Mark_Zuckerberg",
            "text": "Mark Elliot Zuckerberg (born May 14, 1984) is an American computer programmer, Internet entrepreneur, and philanthropist. He is the chairman, chief executive, and co-founder of the social networking website Facebook. His personal wealth, as of December 2015, is estimated to be $46 billion.",
            "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/31/Mark_Zuckerberg_at_the_37th_G8_Summit_in_Deauville_018_v1.jpg/440px-Mark_Zuckerberg_at_the_37th_G8_Summit_in_Deauville_018_v1.jpg",
            }
            ],
 "organizations": [],
 "locations": [
               "San Francisco"
               ]
 }
 ]
